{"data":[{"id":"1","event_name":"MIQ(Round 1)","event_id":"69","description":"Ever wondered what's your IQ? Where do u stand compared to others? If yes then MIQ it is to prove yourself.\n\nDescription:\n\nRound 1: Screening Test\n\nRound 2: There are 8 games which are aptitude based and requires smart and reasoning skills. Participants have to perform different situational tasks and one on one competitions will be there which involves knockouts and eliminations.","event_max_team_number":"1","cat_name":" ACUMEN","cat_id":"19","venue":"NLH 303,304","start_time":"13:30","end_time":"15:00","day":"1","date":"7-Oct","contact_name":"M.Goheth Siddanth","contact_number":"9663604190"},{"id":"2","event_name":"ATR (Round 1)","event_id":"66","description":"An event where brains meet brawns!\nA fun filled event where you race against time and at the same time keep your cool as presence of mind is of utmost importance.\n\nDescription:\n\nRound 1 :  Screening test.\n\nRound 2 : Technical Treasure Hunt where students are given clues to different places across the campus and at each place they are asked to perform tasks with eliminations and detours.","event_max_team_number":"4","cat_name":" ACUMEN","cat_id":"19","venue":"NLH 303,304","start_time":"15:00","end_time":"16:00","day":"1","date":"7-Oct","contact_name":"Abhigyan Sharma","contact_number":"9632676418"},{"id":"3","event_name":"ELUCIDATE(Round 1)","event_id":"67","description":"There are puzzles and then there are PUZZLES. Elucidate is the second kind. There is a lot of code breaking, cryptography, and some \"bang-your-head-on-the-table\" type of questions too! But that's not all! There will be mystery, drama (hopefully no action) and loads of comedy! Just get in here, take out your pencils (and your brains) and just...ELUCIDATE.","event_max_team_number":"3","cat_name":" ACUMEN","cat_id":"19","venue":"NLH 303,304","start_time":"16:00","end_time":"17:00","day":"1","date":"7-Oct","contact_name":"Shileen S. Upadhyay\n","contact_number":"7795122400"},{"id":"4","event_name":"ELUCIDATE(Round 1)","event_id":"67","description":"There are puzzles and then there are PUZZLES. Elucidate is the second kind. There is a lot of code breaking, cryptography, and some \"bang-your-head-on-the-table\" type of questions too! But that's not all! There will be mystery, drama (hopefully no action) and loads of comedy! Just get in here, take out your pencils (and your brains) and just...ELUCIDATE.","event_max_team_number":"3","cat_name":" ACUMEN","cat_id":"19","venue":"NLH 303,304","start_time":"18:00","end_time":"19:00","day":"1","date":"7-Oct","contact_name":"Shileen S. Upadhyay\n","contact_number":"7795122400"},{"id":"5","event_name":"AIB(Round 1)","event_id":"65","description":"Pretty much everything that happens around us has some sound reason underlying it. The question is are you aware of them?This event pertains to testing your general awareness and how good you are at reasoning. Set aside all your engineering formulae and just stick to basics.\n\nDescription:\n\nRound 1 : Screening test.\n\nRound 2 : A video will be shown and participants are required to observe different phenomenas with reasoning.  Trial by Combat- a sub round, deals with reasoning of non-technical statements using existing laws of science and debating.","event_max_team_number":"2","cat_name":" ACUMEN","cat_id":"19","venue":"NLH 304,305","start_time":"17:00","end_time":"18:00","day":"1","date":"7-Oct","contact_name":"KDS Chandan","contact_number":"7795122626"},{"id":"6","event_name":"ARTICULTURE(Round 1)","event_id":"59","description":"Do you have what it takes to be a Bacteriartist? Throw away your acrylics and use bacteria to create your own micro-masterpiece to literally bring your art to life!!\n\nDescription:\n\nThe main aim of this event is to bring out all the artists out there and make them showcase their art using Bacteria. It's a creative and a technical event as without the technique, one can't grow the Bacteria properly and without one's creativity, one cannot win this competition.","event_max_team_number":"1","cat_name":"OPEN CATEGORY","cat_id":"18","venue":"UNIT OPERATIONS LAB BIOTECH","start_time":"13:30","end_time":"14:30","day":"1","date":"7-Oct","contact_name":"Mukund Kabbe","contact_number":"9986165580\n"},{"id":"7","event_name":"SLICE OF LIFE(Round 1)","event_id":"60","description":"Inspired by Dexter, Castle, Sherlock, other crime shows and novels, this Forensics and Biotech based event will be the perfect place to showcase your deduction skills. Come and work your little grey cells!\n\nDescription:\n\nRound 1 : Quiz on Forensics, Crime Scene Knowledge and on TV Shows which contain Murder\/Crime Solving as their main plotline.\n\nRound 2 : Each team will be given a Forensics Report along with a brief introduction to the Crime Scene with clues lying around. Using different tools at their disposal such as DNA Fingerprinting, pH tests, Blood Sampling etc., the participants need to investigate. After they have unraveled the clues,they will be given an idea of the suspects and eye witnesses and they will be allowed to question them. The teams will be graded upon correct use of Forensic Tools, correct questions used for deduction and total time taken for solving the case.","event_max_team_number":"4","cat_name":"OPEN CATEGORY","cat_id":"18","venue":"AB5 205,206","start_time":"13:30","end_time":"15:00","day":"1","date":"7-Oct","contact_name":"Arun Kumar\n","contact_number":"7259648452"},{"id":"8","event_name":"SPACE SETTELMENT(Round 1)","event_id":"62","description":"This event gives the opportunity to design a space settlement that are limited only by the confines of your mind (and science!). Dazzle us with your brilliance in an epic event whose scope is truly unparalleled.\nThe interested participants need to submit a proposal in pdf format on space settlement for 1000 inhabitants which have to include the following details:\n\nObjective of settlement.\nLocation of settlement.\nExternal structure with dimensions\nAllocation of internal areas\nProduction of pseudo gravity with calculations\nLife Support: water, air management.\n \nRules\n\nA team of maximum 4 members can participate. Individual participation is also allowed.  \nThe proposals submitted should be brief and precise.\nThe diagram of external structure should be either isometric view on EG sheets which is scanned and put in the pdf or 3D graphics done on any software.\nPlagiarised projects will be disqualified.\nSubmissions must relate to orbital settlements. Settlements should not be on a planet or moon. They must be permanent, relatively self-sufficient homes, not temporary work camps.\nThe deadline for submitting the project is 29 September,2015.\nSubmissions should be shared in the following drive along with contact details: settlement.tt15@gmail.com\n \nSelected teams will be called for round 1(questionnaire) and round2(on the spot situation) of tech tatva 2015.\n\nThe winners will be awarded with cash prizes.","event_max_team_number":"4","cat_name":"OPEN CATEGORY","cat_id":"18","venue":"NLH 205","start_time":"17:30","end_time":"19:00","day":"1","date":"7-Oct","contact_name":"Hazel Dhir","contact_number":"9591326638"},{"id":"10","event_name":"COUNTER THE BOMB","event_id":"8","description":"Be an expert to diffuse the bomb and save the city!\nParticipants need to design a bot, wired or wireless, installed with cutting and lifting mechanism. A bomb will be a thermocol or a light wooden box placed in an obstacle path with wires of different colours on its way. The bot should carry the bomb onto safe zone by lifting mechanism or cut off band. Suppose the bomb explodes (time ends) before the bot reaches its safe zone or if the bot is unable to diffuse the bomb, points will be deducted considering the number of people within the radius of effect (predefined) of the bomb and hence the winner will be decided. \n\nNOTE: \n1) Extra points will be given for lifting mechanism.\n2) Bomb might be of different sizes, hence more points \n     to diffuse the bigger bomb.\n3) Points will be deducted if there is a physical damage \n     done to the arena.\n4) Bonus points will be awarded if the participants use \n     wireless control.","event_max_team_number":"4","cat_name":"ROBOTREK","cat_id":"3","venue":"FC LEFT SIDE","start_time":"14:00","end_time":"18:00","day":"1","date":"7-Oct","contact_name":"Anubhav Kumar","contact_number":"7259621634"},{"id":"11","event_name":"Mayday","event_id":"32","description":"Mayday challenges you to identify the cause(s) of a historical air crash, through facts and evidence unearthed by officials in the investigations.\n\nDescription:\n\nRound1: Screening test\n\nRound2: Audio Visual Round. The participants are expected to analyze a sequence of events, leading to an aircraft disaster\/emergency and arrive on conclusions based on the evidence and data provided.","event_max_team_number":"2","cat_name":"AIRBORNE","cat_id":"9","venue":"NLH 204","start_time":"18:00","end_time":"20:00","day":"1","date":"7-Oct","contact_name":"Anuj Arora","contact_number":"9663562083"},{"id":"12","event_name":"3D GLOW TRIX(Round 1)","event_id":"50","description":"There's something that 3D gives to a picture, that takes you to another world?\nA 3D LED cube, code using basic arduino, with only time management and coding skills required to overcome the obstacles and reach the finish line!\n\nDescription:\n\nRound 1: The participants will be given an 7X7X7 LED Cube and certain coordinates. Find the shortest path using Arduino coding in the minimum time, passing through the delays and obstacles of 3 diff LEDs, red, green and white. The one who clears the path in shortest time in max 3 trials with the least time travelled proceeds to Round 2.\n\nRound 2: The participants will be asked to create a logo or symbol by coding, on the LED cube. The one who codes the fastest in the given frame of time will emerge victorious.","event_max_team_number":"4","cat_name":"MECHATRON","cat_id":"14","venue":"AB5 207 208","start_time":"13:00","end_time":"15:00","day":"1","date":"7-Oct","contact_name":"ANAMIKA","contact_number":"7204276324"},{"id":"13","event_name":"CODE WARS(Round 1)","event_id":"2","description":"Code fast. Code right. Win the war! It is one of a kind which brings the players in for a one on one battle to make it to the top. The only weapon you have is your code.\n\nDescription:\n\nRound 1:  Basic problem solving on paper through which top 8\/16 teams will be selected.\n\nRound 2:  One on One coding in a round-robin eliminator system.","event_max_team_number":"2","cat_name":"CRYPTOSS","cat_id":"1","venue":"AB5 306,307,308","start_time":"16:30","end_time":"18:00","day":"1","date":"7-Oct","contact_name":"Nimish Singhal","contact_number":"7795122828"},{"id":"14","event_name":"PEITH O OMADA(Round 1)","event_id":"3","description":"It's time to code,but it's not just your coding skills that matter, it's the trust you have in your partner,the teamwork!\n\nDescription:\n\nRound1: It will be pen and paper, slides\/ output based questions. Teammates will be separated and asked to answer separately.\n\nRound2:  It will be code juggling. Simple programs will be given and teammates will have to write the code one after the other after a time slice.\n","event_max_team_number":"2","cat_name":"CRYPTOSS","cat_id":"1","venue":"AB5 306,307","start_time":"18:00","end_time":"19:30","day":"1","date":"7-Oct","contact_name":"Utkarsh Bindal","contact_number":"9986665460"},{"id":"15","event_name":"CORPORATE RUSH(Round 1)","event_id":"22","description":"This event promotes the spirit of business management and skill development. A perfect event to test a participant on his creativity and quick- thinking ability.\n\nDescription:\n\nRound1: Screening test on IQ.\n\nRound2: All teams will be given locations of 5 stations, pertaining to different departments in a business, where they have to go and perform tasks: \n\t\n1) Human Resources\n\n2) Finance\n\n3) Marketing\n\n4) Legal\n\n5) Logistics and Operations","event_max_team_number":"2","cat_name":"BIZZMAESTRO","cat_id":"6","venue":"NLH 104,105","start_time":"13:30","end_time":"15:30","day":"1","date":"7-Oct","contact_name":"Sahil Jain","contact_number":"7204065050"},{"id":"16","event_name":"WINNER STANDS ALONE(Round 1)","event_id":"23","description":"This event is here to pick out the quickest and cleverest one of them all testing all the aspects of being a successful businessman. \n\nDescription:\n\nRound1: \"Strain your Brain\"?. Screening test.\n\nRound2: Each individual will be grouped into 5 teams of 4 people. A case study of 5 different individuals who perform menial jobs e.g. Chai Walla, domestic helper, auto driver etc. will be provided along with a detailed account on the lives of these individuals like their monthly salary, expenses, alternate sources of income, constraints. Keeping all of this in mind, the team has to make a \"5-year Plan of Action\" to make their current business more profitable.\n\nRound3: This round proves to be a splendid concoction of three events to test the swiftness of the mind, oratory, and improvisation skills of the contestants.","event_max_team_number":"1","cat_name":"BIZZMAESTRO","cat_id":"6","venue":"NLH 104,105","start_time":"15:30","end_time":"18:30","day":"1","date":"7-Oct","contact_name":"Krsna Agrawal","contact_number":"7204083939"},{"id":"17","event_name":"SWADES","event_id":"27","description":"Ever thought of a future city which is smart and energy efficient? Grab your chance to design your own city, relocate resources in the infrastructure of the city-in-hand, make it eco-friendly and exclusive! Go on, Imagine Away!\n\nDescription:\n\nRound 1: Treasure hunt-solve the clues to  reach the next destination and perform the task  in the shortest time.\n\nRound 2: Plan a city.","event_max_team_number":"2","cat_name":"ENERGIA","cat_id":"7","venue":"AB5 209,210","start_time":"13:30","end_time":"16:30","day":"1","date":"7-Oct","contact_name":"Sushmita","contact_number":"9845567087"},{"id":"18","event_name":"ALGO WARS","event_id":"28","description":"Debate. Algorithm. Waste Management: Debate your way for efficient methods to clean your city, implement that thought in your design for your own algorithm to reduce waste reduction, play a part in the first step towards solving this issue.\n\nDescription:\n\nRound 1:Debate.\nBased on online study guides, every team will  give an on-stage speech for  7-minute on the topic at hand, followed by a debating session. \n\nRound2:  5 incomplete algorithms would be provided. These algorithms need to be corrected\/completed in the specified time. Each team can challenge the submitted solutions of other participants in the room by constructing test cases, in an attempt to generate erroneous output. The challenger receives points for a successful challenge (the challenged team loses all his points for that problem), and loses points for an unsuccessful challenge.","event_max_team_number":"2","cat_name":"ENERGIA","cat_id":"7","venue":"AB5 207,208","start_time":"15:30","end_time":"17:30","day":"1","date":"7-Oct","contact_name":"Roli Khanna","contact_number":"9663553960"},{"id":"19","event_name":"MAZER LASER (Round 1)","event_id":"14","description":"It gives a practical chance to play with the Laws of Reflection. Test your knowledge and reflect the laser to get the phasor.\n\nDescription:\n\nRound1: Screening test.\n\nRound2: The participants are expected to make mirror\/ lens arrangements between a beam of laser light and a pin hole camera so that it hits all the mirrors and reaches the camera.\nRound3: The participants have to make different geometric waveforms from the arrangement.","event_max_team_number":"3","cat_name":"ALACRITY","cat_id":"4","venue":"NLH 204,205","start_time":"14:30","end_time":"16:00","day":"1","date":"7-Oct","contact_name":"Rishabh Mahajan","contact_number":"9663606723"},{"id":"20","event_name":"FOX HUNT(Round 1)","event_id":"12","description":"An event wherein one can learn the actual working of an antenna and make their own models to find the treasure.\n\nDescription:\n\nRound1: Screening test.\n\nRound 2: Designing and building of an antenna followed by treasure hunt where transmitters of different frequencies are hidden in the places and the hidden devices have to be found out using that antenna.","event_max_team_number":"3","cat_name":"ALACRITY","cat_id":"4","venue":"NLH 203","start_time":"14:00","end_time":"15:30","day":"1","date":"7-Oct","contact_name":"G Abhishek Kumar Reddy ","contact_number":"9844312763"},{"id":"21","event_name":"Devil Karters","event_id":"41","description":"Build your own GO-KART and enjoy your first kraftwagen.\n\nDescription:\n\nRound1 : Screening Test.\n\nRound2 : Basic Catia Training workshop.\n\nRound3 : The Designing and the Analysis: They will be given a day's time to design their own Kart on CATIA having the following major components:\na. Frame and steering\nb. Mountings\nc. Seat Frame\n\nRound4 : Each model is analyzed in Ansys and only top two teams get to fabricate the GO-KART.","event_max_team_number":"1","cat_name":"KRAFTWAGEN","cat_id":"12","venue":"NLH 103","start_time":"13:00","end_time":"17:30","day":"1","date":"7-Oct","contact_name":"Utkarsh Mehrotra","contact_number":"991689716"},{"id":"22","event_name":"BRAKEFAST","event_id":"42","description":"Description:\n\nRound 1: It is a race in which two randomly selected teams would be asked to race against each other and stop the bot in the braking zone. The team that completes first qualifies for the second round.\n\nRound 2:  The participants are required to maneuver the bot through a series of obstacles and stop at the required braking zones. The bot taking the least time to complete the track wins!","event_max_team_number":"4","cat_name":"KRAFTWAGEN","cat_id":"12","venue":"BEHIND IC","start_time":"13:00","end_time":"18:00","day":"1","date":"7-Oct","contact_name":"Akshat Mathur","contact_number":"9916866641"},{"id":"23","event_name":"HACK ATTACK(Round 1)","event_id":"30","description":"Hackattack bridges the gap between 2 parallel domains of medicine and engineering. \n\n Description:\n\nThe solution to the problem statement must be a working model and the participants will be tested on their concept idea, creativity, design, and marketability of the product\/solution.\nExpand your horizons through cross-disciplinary exposure to the field of medical technology. Happy Hacking!!","event_max_team_number":"3","cat_name":"EPSILON","cat_id":"8","venue":"NLH 202","start_time":"14:00","end_time":"20:00","day":"1","date":"7-Oct","contact_name":"Amey Chitnis","contact_number":"9620460992"},{"id":"24","event_name":"MEDIWEAR","event_id":"29","description":"An event where fashion meets technology. Drawing inspiration from the likes of google glass, i-watch and other wearable technologies, mediwear bridges the gap between the domains of fashion, technology and healthcare. This event is designed to test your creativity on designing clothes and accessories, with a technology twist that help us live a healthy lifestyle. The main challenge is that the product MUST have a healthcare application. A toolkit will be provided to the participants beforehand and a working prototype must be presented by them during the event.","event_max_team_number":"2","cat_name":"EPSILON","cat_id":"8","venue":"AB5 301,302","start_time":"14:00","end_time":"18:00","day":"1","date":"7-Oct","contact_name":"S. Lakshmi Lasya","contact_number":"7259641344"},{"id":"25","event_name":"VEDANT 5.0","event_id":"77","description":"VEDANTH a featured event of TechTatva is a technical exhibition which serves as a platform for the students to demonstrate their unique and innovative ideas. VEDANTH's vision is to bridge the gap between innovation and excellence in a more dynamic and a logical approach.\nIt is a 2 day event.\n\nDay1: VEDANTH 5.0 will show you what the next-level of Robotics is! This time, we thrive to present to you the most cutting-edge projects. Come, get enthralled!\n\nDay2: This time the platform of Vedanth is open to all. The projects on display will be based on the following themes:\n1)Renewable Energy\n2)Internet of Things\n3)Rainwater Harvesting\n4)Able the Disabled\nThe above themes aim to push the students to come up with solutions which can serve the humanity in a more technical, cost-effective and simple way.","event_max_team_number":"4","cat_name":"FEATURED EVENT","cat_id":"17","venue":"QUADRANGLE","start_time":"13:00","end_time":"19:00","day":"1","date":"7-Oct","contact_name":"Abhishek Mahapatra","contact_number":"7353145975"},{"id":"26","event_name":"PAPER PRESENTATION","event_id":"78","description":"TechTatva '15 invites the bright minds across this nation to present their ground breaking ideas and take part in the Technical Paper Presentation Competition hosted by MIT, Manipal. Every year around 400 talented individuals from various engineering streams participate and exhibit their ideas in front of our esteemed panel of judges.\nThe abstract must be original and should not break any copyright laws. Also, it must follow the IEEE format.\nThere is no restriction on the subject.\nDeadline for the submission of abstracts is 29 Sept, 2015.\nThere can be a team of maximum 4 participants.\nTime limit for presentation is 10 minutes.\nSend in your abstracts to both the id's:\npaperpresentation@techtatva.in\npaperpresentationtt15@gmail.com\nAll short listed candidates shall present their papers during TechTatva i.e within 7-10 Oct, 2015.\nDetails must contain :\nName of team mates .\nCollege Name\nTitle of Paper\nBranch of all participants.\n","event_max_team_number":"4","cat_name":"FEATURED EVENT","cat_id":"17","venue":"AB5 313,314,315,316","start_time":"14:00","end_time":"17:30","day":"1","date":"7-Oct","contact_name":"Dakshesh","contact_number":"9663584993"},{"id":"27","event_name":"ROBO WARS","event_id":"79","description":"It began with the strike of a hammer. The opponent tried to block it but failed. Outside the ring his controlled grappled with the joystick. Trying to bring it back into control. Yet Thor went on, smashing away with the force of a Viking God, blow after blow, bending steel and crushing metal. Thor's controller gunned away with fury, this was what it had all been about. Unquestioned victory. But it wasn't going to end now, and in a final try for victory the man outside the ring pressed a button, as the air filled with the sounds of whirring blades... \nThis was War. And only the best Robot would emerge in glory.\n","event_max_team_number":"7","cat_name":"ROBO WARS","cat_id":"17","venue":"KC ARENA","start_time":"17:00","end_time":"20:00","day":"1","date":"7-Oct","contact_name":"Satyam","contact_number":"9740646760"},{"id":"28","event_name":"Magnet Gun (Round 1)","event_id":"47","description":"If you think using a gun is easy, make it one of your own!\n\nDescription:\n\nRound1 : Screening test based on basic magnetism and magnetic properties.\n\nRound2 : Teams have to make track of magnets for the bullets. The one travelling the largest distance wins the competition.","event_max_team_number":"4","cat_name":"ELECTRIFIC","cat_id":"13","venue":"NLH 204,205","start_time":"16:00","end_time":"17:30","day":"1","date":"7-Oct","contact_name":"Mohit Kumar","contact_number":"9663587278"},{"id":"29","event_name":"INDUSTRIALIZE(Round 1)","event_id":"40","description":"Understand the fuel that powers the world. We invite you to envision and design your very own petroleum refinery.\n\nDescription:\n\nRound1: An aptitude test, based on logic, and basic science and math.\n\nRound2: The participants are provided with a fixed amount of capital and they are supposed to purchase suitable equipment within the budget, to build the ideal chemical plant from the provided resources.","event_max_team_number":"2","cat_name":"CHEMINOVA","cat_id":"11","venue":"NLH 203","start_time":"18:00","end_time":"20:00","day":"1","date":"7-Oct","contact_name":"Amey Murur","contact_number":"9773006604"},{"id":"30","event_name":"METAL MAN (Round 1)","event_id":"36","description":"Description:\n\nRound1: 3D view of an object will be given, the participants have to make the actual model in a suitable scale using thermocol.\n\nRound2: 2D views of an object will be given and the participants have to make the object in 3D to a suitable size using GI sheet and soldering.","event_max_team_number":"2","cat_name":"MECHANIZE","cat_id":"10","venue":"D 309,310,322","start_time":"14:00","end_time":"17:00","day":"1","date":"7-Oct","contact_name":"RAJ VENKATESH","contact_number":"9916880589\n"},{"id":"31","event_name":"CONKREATION (Round 1)","event_id":"16","description":"Survival of the strongest. \nConcrete, the DNA of modern construction, can turn mud to moulds, bricks to buildings, buildings to cities and cities to nations. Here we bring you a chance to learn the elementary practises in construction though a workshop and compete your way to cast the best building  blocks in teams of two.","event_max_team_number":"2","cat_name":"CONSTRUCTURE","cat_id":"5","venue":"MT LAB 2","start_time":"18:00","end_time":"20:00","day":"1","date":"7-Oct","contact_name":"Naman Jain","contact_number":"7795170606"},{"id":"32","event_name":"TRASH TOWN(Round 1)","event_id":"17","description":"Don't waste the WASTE!!! Solve quizzes for completing the journey and craft a new city using waste materials and be the reason for the survival of human beings.\n\nDescription:\n\nRound 1: An EQ\/IQ  round, including questions regarding planning, environment friendly engineering and sustainable development.\n\nRound2: Participants will have to plan out an entire city starting from road networks to buildings and architecture, all from waste.","event_max_team_number":"2","cat_name":"CONSTRUCTURE","cat_id":"5","venue":"NLH 203","start_time":"16:00","end_time":"17:30","day":"1","date":"7-Oct","contact_name":"Malaya Vardhan","contact_number":"9916869264"},{"id":"33","event_name":"AIB (Round1)","event_id":"65","description":"Pretty much everything that happens around us has some sound reason underlying it. The question is are you aware of them?This event pertains to testing your general awareness and how good you are at reasoning. Set aside all your engineering formulae and just stick to basics.\n\nDescription:\n\nRound 1 : Screening test.\n\nRound 2 : A video will be shown and participants are required to observe different phenomenas with reasoning.  Trial by Combat- a sub round, deals with reasoning of non-technical statements using existing laws of science and debating.","event_max_team_number":"2","cat_name":"Acumen ","cat_id":"19","venue":"NLH - 303,304","start_time":"13:30","end_time":"14:30","day":"2","date":"8-Oct-15","contact_name":"KDS Chandan","contact_number":"7795122626"},{"id":"34","event_name":"ATR (Round 1)","event_id":"66","description":"An event where brains meet brawns!\nA fun filled event where you race against time and at the same time keep your cool as presence of mind is of utmost importance.\n\nDescription:\n\nRound 1 :  Screening test.\n\nRound 2 : Technical Treasure Hunt where students are given clues to different places across the campus and at each place they are asked to perform tasks with eliminations and detours.","event_max_team_number":"4","cat_name":"Acumen ","cat_id":"19","venue":"NLH - 303,304","start_time":"14:30","end_time":"15:30","day":"2","date":"8-Oct-15","contact_name":"Abhigyan Sharma","contact_number":"9632676418"},{"id":"35","event_name":"MIQ (Round 1)","event_id":"69","description":"Ever wondered what's your IQ? Where do u stand compared to others? If yes then MIQ it is to prove yourself.\n\nDescription:\n\nRound 1: Screening Test\n\nRound 2: There are 8 games which are aptitude based and requires smart and reasoning skills. Participants have to perform different situational tasks and one on one competitions will be there which involves knockouts and eliminations.","event_max_team_number":"1","cat_name":"Acumen ","cat_id":"19","venue":"NLH - 303,304","start_time":"15:30","end_time":"16:30","day":"2","date":"8-Oct-15","contact_name":"M.Goheth Siddanth","contact_number":"9663604190"},{"id":"36","event_name":"AIB (Round1)","event_id":"65","description":"Pretty much everything that happens around us has some sound reason underlying it. The question is are you aware of them?This event pertains to testing your general awareness and how good you are at reasoning. Set aside all your engineering formulae and just stick to basics.\n\nDescription:\n\nRound 1 : Screening test.\n\nRound 2 : A video will be shown and participants are required to observe different phenomenas with reasoning.  Trial by Combat- a sub round, deals with reasoning of non-technical statements using existing laws of science and debating.","event_max_team_number":"2","cat_name":"Acumen ","cat_id":"19","venue":"NLH - 303,304","start_time":"16:30","end_time":"17:30","day":"2","date":"8-Oct-15","contact_name":"KDS Chandan","contact_number":"7795122626"},{"id":"37","event_name":"Catch the Light","event_id":"9","description":"Control your bot using light and light sensitive sensors. Drive your bot out of the Maze, countering the obstacles in minimum possible time to win.\nContestants must use a light source to control a robot about a course like a maze. The maze will have uneven terrain. The robot may have sensors in front of it to tell it which direction to move in, if the contestant points the laser to the respective sensors. The bot which finishes the maze in the least time and with more precision will be the winner.\n\nNOTE: \n1) Points will be deducted if the bot damages the arena.\n2) Bonus points will be awarded if the participants use wireless control.","event_max_team_number":"4","cat_name":"Robotrek","cat_id":"3","venue":"Left Side front of FC Pool","start_time":"18:00","end_time":"20:00","day":"2","date":"8-Oct-15","contact_name":"Vaibhav Thacker","contact_number":"7259624308"},{"id":"38","event_name":"Fox Hunt (Round 2)","event_id":"12","description":"An event wherein one can learn the actual working of an antenna and make their own models to find the treasure.\n\nDescription:\n\nRound1: Screening test.\n\nRound 2: Designing and building of an antenna followed by treasure hunt where transmitters of different frequencies are hidden in the places and the hidden devices have to be found out using that antenna.","event_max_team_number":"3","cat_name":"Alacrity","cat_id":"4","venue":"Soldering Workshop","start_time":"13:30","end_time":"17:30","day":"2","date":"8-Oct-15","contact_name":"G Abhishek Kumar Reddy ","contact_number":"9844312763"},{"id":"39","event_name":"Metal Trace (Round 1)","event_id":"13","description":"As the name indicates, one needs to implement a fully functioning metal detector using 555 timer. This being an event, preceded by an all-inclusive workshop, is for those possessed by a drive to track down their prey.","event_max_team_number":"3","cat_name":"Alacrity","cat_id":"4","venue":"AB5 210,211","start_time":"16:30","end_time":"18:00","day":"2","date":"8-Oct-15","contact_name":"S.R.Raveena Kusumanchi","contact_number":"9880729507"},{"id":"40","event_name":"No strings attached (Round1)","event_id":"15","description":"Be Apollo for a day. Learn to make a harp using Arduino in our workshop and produce the needed harmonic sound by playing with the string of a laser light.","event_max_team_number":"3","cat_name":"Alacrity","cat_id":"4","venue":"AB5 206,207","start_time":"14:30","end_time":"16:00","day":"2","date":"8-Oct-15","contact_name":"Nishant Dulani","contact_number":"7795175500"},{"id":"41","event_name":"Junkyard Wars (Round1)","event_id":"38","description":"Test your engineering skills and challenge your mind in this Mechanical Roller Coaster.\n\nDescription:\n\nThere will be 2 rounds in which the participants will be given 2 different problem statements based on which they will be required to build the mechanical structures using the materials provided in the time limit.","event_max_team_number":"3","cat_name":"Mechanize","cat_id":"10","venue":"AB1 D-309,D-310,D-322","start_time":"13:30","end_time":"18:30","day":"2","date":"8-Oct-15","contact_name":"KAUSHIK APTE","contact_number":"7795179333\n"},{"id":"42","event_name":"Metal Man (Round 2)","event_id":"36","description":"Description:\n\nRound1: 3D view of an object will be given, the participants have to make the actual model in a suitable scale using thermocol.\n\nRound2: 2D views of an object will be given and the participants have to make the object in 3D to a suitable size using GI sheet and soldering.","event_max_team_number":"2","cat_name":"Mechanize","cat_id":"10","venue":"Soldering Workshop 2","start_time":"14:00","end_time":"18:00","day":"2","date":"8-Oct-15","contact_name":"RAJ VENKATESH","contact_number":"9916880589\n"},{"id":"43","event_name":"Devil Karters","event_id":"41","description":"Build your own GO-KART and enjoy your first kraftwagen.\n\nDescription:\n\nRound1 : Screening Test.\n\nRound2 : Basic Catia Training workshop.\n\nRound3 : The Designing and the Analysis: They will be given a day's time to design their own Kart on CATIA having the following major components:\na. Frame and steering\nb. Mountings\nc. Seat Frame\n\nRound4 : Each model is analyzed in Ansys and only top two teams get to fabricate the GO-KART.","event_max_team_number":"1","cat_name":"Kraftwagen","cat_id":"12","venue":"Automobile Workshop","start_time":"13:00","end_time":"19:00","day":"2","date":"8-Oct-15","contact_name":"Utkarsh Mehrotra","contact_number":"991689716"},{"id":"44","event_name":"Marine Surfers","event_id":"43","description":"Description:\n\nThe participants are required to make a submarine with a using 4 motors( 2 for propulsion and turning and other 2 for surfacing).\n\nRound 1: There will be a goal at one end of the track and plastic balls floating on the other end, participants need to make as many goals possible in 90 seconds of time.\n\nRound 2: The  submarines will have to race in a series of rings floating in the pool in the least time to win the game.","event_max_team_number":"4","cat_name":"Kraftwagen","cat_id":"12","venue":"FC Pool","start_time":"13:00","end_time":"18:00","day":"2","date":"8-Oct-15","contact_name":"Manaswinee Ghadei","contact_number":"7259644279"},{"id":"45","event_name":"Vedanth 5.0","event_id":"77","description":"VEDANTH a featured event of TechTatva is a technical exhibition which serves as a platform for the students to demonstrate their unique and innovative ideas. VEDANTH's vision is to bridge the gap between innovation and excellence in a more dynamic and a logical approach.\nIt is a 2 day event.\n\nDay1: VEDANTH 5.0 will show you what the next-level of Robotics is! This time, we thrive to present to you the most cutting-edge projects. Come, get enthralled!\n\nDay2: This time the platform of Vedanth is open to all. The projects on display will be based on the following themes:\n1)Renewable Energy\n2)Internet of Things\n3)Rainwater Harvesting\n4)Able the Disabled\nThe above themes aim to push the students to come up with solutions which can serve the humanity in a more technical, cost-effective and simple way.","event_max_team_number":"4","cat_name":"Featured Event","cat_id":"17","venue":"IC Area","start_time":"13:30","end_time":"18:30","day":"2","date":"8-Oct-15","contact_name":"Abhishek Mahapatra","contact_number":"7353145975"},{"id":"46","event_name":"Corporate Rush (Round 2)","event_id":"22","description":"This event promotes the spirit of business management and skill development. A perfect event to test a participant on his creativity and quick- thinking ability.\n\nDescription:\n\nRound1: Screening test on IQ.\n\nRound2: All teams will be given locations of 5 stations, pertaining to different departments in a business, where they have to go and perform tasks: \n\t\n1) Human Resources\n\n2) Finance\n\n3) Marketing\n\n4) Legal\n\n5) Logistics and Operations","event_max_team_number":"2","cat_name":"BizzMaestro","cat_id":"6","venue":"NLH 205","start_time":"15:30","end_time":"18:30","day":"2","date":"8-Oct-15","contact_name":"Sahil Jain","contact_number":"7204065050"},{"id":"47","event_name":"Buzzinga (Round 1)","event_id":"21","description":"Buzzinga brings to you a wholesome experience of getting your start up, up and running and showcase your entrepreneurial skills by solving problems that you may face in the real world.\n\nDescription:\n\nRound1: Screening test\n\nRound 2: It has 2 sections. \nSection1:\nThis is the test of participants to work in groups and they have to come up with quality products based on the arbitrary resources provided to them. The participants need to keep the following in mind: \n1. The Innovation of the Product.\n2. The Cost Involved .\n3. The Market Capability.\nSection 2:\nOut of 12, only 5 teams will be selected. The selected teams have to attend a mock event where 3 kinds of investors are socializing: an angel investor, a venture capitalist and a seed investor, each having a fixed capital and a pre-set deal. The teams have to negotiate and lock down a deal with any one of them and the best deal wins.","event_max_team_number":"1","cat_name":"BizzMaestro","cat_id":"6","venue":"AB5- 201,202,203,204","start_time":"13:30:00","end_time":"15:30:00","day":"2","date":"8-Oct-15","contact_name":"Divyeshakti Marwah","contact_number":"7829700576"},{"id":"48","event_name":"Winner stands alone (Round 2)","event_id":"23","description":"This event is here to pick out the quickest and cleverest one of them all testing all the aspects of being a successful businessman. \n\nDescription:\n\nRound1: \"Strain your Brain\"?. Screening test.\n\nRound2: Each individual will be grouped into 5 teams of 4 people. A case study of 5 different individuals who perform menial jobs e.g. Chai Walla, domestic helper, auto driver etc. will be provided along with a detailed account on the lives of these individuals like their monthly salary, expenses, alternate sources of income, constraints. Keeping all of this in mind, the team has to make a \"5-year Plan of Action\" to make their current business more profitable.\n\nRound3: This round proves to be a splendid concoction of three events to test the swiftness of the mind, oratory, and improvisation skills of the contestants.","event_max_team_number":"1","cat_name":"BizzMaestro","cat_id":"6","venue":"AB5- 205","start_time":"14:00","end_time":"16:30","day":"2","date":"8-Oct-15","contact_name":"Krsna Agrawal","contact_number":"7204083939"},{"id":"49","event_name":"Mobivision","event_id":"6","description":"The event will be providing a vital and necessary head start to aspiring Android Developers. The participants need to develop a smart and innovative Android Application.","event_max_team_number":"1","cat_name":"Turing","cat_id":"20","venue":"NLH 204","start_time":"13:30","end_time":"16:30","day":"2","date":"8-Oct-15","contact_name":"Anirudh Raghunath","contact_number":"9663608586"},{"id":"50","event_name":"Flight of fantasy","event_id":"31","description":"It deals with flight simulation. So set your flight plan and fasten your seat belts for flight of fantasy. FSX has been one of the most successful simulator in the history of Flight Simulation.\n\nDescription:\n\nParticipants in this event will be provided with facilities to fly an aircraft, the Boeing 737-800, and all the operational procedures of this aircraft from the Startup to the Shutdown and communications with the ATC (Air Traffic Controllers). The participant will then have to fly between two airports as per the problem statement and the results will be declared on the Flight Data Analysis obtained from proprietary judging software incorporated into the Simulator.","event_max_team_number":"1","cat_name":"Airborne","cat_id":"9","venue":"NLH 104","start_time":"14:00","end_time":"18:00","day":"2","date":"8-Oct-15","contact_name":"K M Sree Vaibhav Reddy","contact_number":"9502473603"},{"id":"51","event_name":"Water rocket (Round 1)","event_id":"33","description":"Ever thought of making your own rocket, that too with a soft drink bottle and pressurized water! Well guess what, here is your chance, design your own innovative water propelled rocket using principles of propulsion, aerodynamics, projectile motion and feel your adrenaline rush. \n\nDescription:\n\nRound 1: The water rockets will be judged on design by the judges and their basic knowledge will be put to test.\n\nRound 2: The participants launch the rockets and their maximum range is judged.\n\nRound 3: This round judges the participant's knowledge about their rockets. Targets are set on the field and the participant hit it.","event_max_team_number":"4","cat_name":"Airborne","cat_id":"9","venue":"Quandrangle","start_time":"14:30","end_time":"17:30","day":"2","date":"8-Oct-15","contact_name":"Aditya Bajoria\n","contact_number":"9901306810"},{"id":"52","event_name":"Does your grey matter (Round 1)","event_id":"61","description":"Play Fast! Play Smart! Does Your Grey Matter? \nEver imagined yourself in a TV quiz show? We bring to you an adapted version of the famous 90's show Going For Gold.\nSeize the opportunity to test your intelligence on various themes such as history, politics, art, science and technology and so on by answering quizzes and gear up for our final surprise.\n\nDescription:\n\nRound 1 : Screening test.\n\nRound 2 : Beat the Buzzer is a buzzer round followed by a Themed Rapid fire quiz.\n\nRound 3 : It has 2 parts.\n\na) Circuit Relay\nThe teams will have to build a particular circuit within a given time limit.\n\nb) Spot The Error.\nEach team will have to create a maximum of 7 errors in the given circuit. The circuits will then be exchanged among each other and the teams will have to identify the particular errors in the circuit within an allotted time.\n","event_max_team_number":"2","cat_name":"Epsilon","cat_id":"8","venue":"NLH 202,203,204","start_time":"17:00","end_time":"20:00","day":"2","date":"8-Oct-15","contact_name":"Sudharshinee Goordoyal","contact_number":"7259612094"},{"id":"53","event_name":"Hack Attack (Round2)","event_id":"30","description":"Hackattack bridges the gap between 2 parallel domains of medicine and engineering. \n\n Description:\n\nThe solution to the problem statement must be a working model and the participants will be tested on their concept idea, creativity, design, and marketability of the product\/solution.\nExpand your horizons through cross-disciplinary exposure to the field of medical technology. Happy Hacking!!","event_max_team_number":"3","cat_name":"Epsilon","cat_id":"8","venue":"AB5- 301,302","start_time":"14:00","end_time":"20:00","day":"2","date":"8-Oct-15","contact_name":"Amey Chitnis","contact_number":"9620460992"},{"id":"54","event_name":"Pietho Omada","event_id":"3","description":"It's time to code,but it's not just your coding skills that matter, it's the trust you have in your partner,the teamwork!\n\nDescription:\n\nRound1: It will be pen and paper, slides\/ output based questions. Teammates will be separated and asked to answer separately.\n\nRound2:  It will be code juggling. Simple programs will be given and teammates will have to write the code one after the other after a time slice.\n","event_max_team_number":"2","cat_name":"Cryptoss","cat_id":"1","venue":"AB5- 304,305","start_time":"13:00","end_time":"14:30:00","day":"2","date":"8-Oct-15","contact_name":"Utkarsh Bindal","contact_number":"9986665460"},{"id":"55","event_name":"Decepticode (Round 1)","event_id":"1","description":"Prove yourself in Decepticode where your concepts, knowledge and aptitude will be thorougly tested with the help of an unknown programming language.\n\nDescription:\n\nRound1: It will have questions to test the candidate's logic and coding ability.\n\nRound2: Participants will be given a new programming language which they will need to learn on the spot and implement a given challenge using the given programming language.","event_max_team_number":"2","cat_name":"Cryptoss","cat_id":"1","venue":"AB5- 306,307,308","start_time":"14:30","end_time":"16:00","day":"2","date":"8-Oct-15","contact_name":"Ashish Mehrotra\n","contact_number":"9663580466"},{"id":"56","event_name":"Code Wars (Round 2)","event_id":"2","description":"Code fast. Code right. Win the war! It is one of a kind which brings the players in for a one on one battle to make it to the top. The only weapon you have is your code.\n\nDescription:\n\nRound 1:  Basic problem solving on paper through which top 8\/16 teams will be selected.\n\nRound 2:  One on One coding in a round-robin eliminator system.","event_max_team_number":"2","cat_name":"Cryptoss","cat_id":"1","venue":"NLH 105","start_time":"17:00","end_time":"19:30","day":"2","date":"8-Oct-15","contact_name":"Nimish Singhal","contact_number":"7795122828"},{"id":"57","event_name":"GET BUGGED (OR) DEBUG IT (Round 1)","event_id":"46","description":"Solve the problem statement using circuit's components which will be provided on the spot. The competition comprises of designing of circuit, debugging of circuit using basic electronics knowledge. Are you wired to compete?\n\nDescription:\n\nRound1 : Screening test.\n\nRound2 : The participants will be given an output waveform and they have to design a circuit giving that desired output. ","event_max_team_number":"3","cat_name":"Electrific","cat_id":"13","venue":"NLH 105, 202","start_time":"15:00","end_time":"16:30","day":"2","date":"8-Oct-15","contact_name":"Vishal Sharma","contact_number":"9663579694"},{"id":"58","event_name":"Magnet Gun (Round 2)","event_id":"47","description":"If you think using a gun is easy, make it one of your own!\n\nDescription:\n\nRound1 : Screening test based on basic magnetism and magnetic properties.\n\nRound2 : Teams have to make track of magnets for the bullets. The one travelling the largest distance wins the competition.","event_max_team_number":"4","cat_name":"Electrific","cat_id":"13","venue":"Carpentary Workshop","start_time":"14:00","end_time":"18:00","day":"2","date":"8-Oct-15","contact_name":"Mohit Kumar","contact_number":"9663587278"},{"id":"59","event_name":"Road Runner (Round 1)","event_id":"19","description":"The road less travelled.  Speed through the set course using clues, each leading you to a new task. Each task is designed to test the scientific caliber, speed and knowledge of the commonly used surveying instruments.\n\nDescription:\n\nRound1: Each group of 2 is given a map with varied geological and physical features. The participants must be able to carve out the most efficient and economical roadway across the two mentioned points through appropriate instruments.\n\nRound 2: The qualified teams will have to compete against each other in this time-based event. They will have to use the readings of the surveying instruments at a given location at the next location.","event_max_team_number":"2","cat_name":"Contructure","cat_id":"5","venue":"NLH 203","start_time":"13:30","end_time":"15:30","day":"2","date":"8-Oct-15","contact_name":"Sreya Nayani","contact_number":"7795178686"},{"id":"60","event_name":"Trash town (Round 1)","event_id":"17","description":"Don't waste the WASTE!!! Solve quizzes for completing the journey and craft a new city using waste materials and be the reason for the survival of human beings.\n\nDescription:\n\nRound 1: An EQ\/IQ  round, including questions regarding planning, environment friendly engineering and sustainable development.\n\nRound2: Participants will have to plan out an entire city starting from road networks to buildings and architecture, all from waste.","event_max_team_number":"2","cat_name":"Contructure","cat_id":"5","venue":"AB1 D-307","start_time":"15:30","end_time":"18:30","day":"2","date":"8-Oct-15","contact_name":"Malaya Vardhan","contact_number":"9916869264"},{"id":"61","event_name":"3D Glowtrix (Round 2)","event_id":"50","description":"There's something that 3D gives to a picture, that takes you to another world?\nA 3D LED cube, code using basic arduino, with only time management and coding skills required to overcome the obstacles and reach the finish line!\n\nDescription:\n\nRound 1: The participants will be given an 7X7X7 LED Cube and certain coordinates. Find the shortest path using Arduino coding in the minimum time, passing through the delays and obstacles of 3 diff LEDs, red, green and white. The one who clears the path in shortest time in max 3 trials with the least time travelled proceeds to Round 2.\n\nRound 2: The participants will be asked to create a logo or symbol by coding, on the LED cube. The one who codes the fastest in the given frame of time will emerge victorious.","event_max_team_number":"4","cat_name":"Mechatron","cat_id":"14","venue":"AB5 401,402","start_time":"17:30","end_time":"19:30","day":"2","date":"8-Oct-15","contact_name":"ANAMIKA","contact_number":"7204276324"},{"id":"62","event_name":"Robotic Piano player (Round 1)","event_id":"53","description":"Play the piano and dance to your own tunes as your own bot taps the keys, in accordance with your microcontroller coding skills and bot building technique.\nAlso, knowledge of any musical instrument is not a prerequisite.\n\nDescription:\n\nRound1: The models will be made to play any tune on a toy keyboard using the materials given and not any personal physical contact (like using fingers). So the playing of the keyboard will be automatic based on the programmed Arduino with mechanical and electrical equipment.\n\nRound2: Total of nine tunes will be offered, every three of these nine tunes belong to Easy, Average and Difficult Categories. Each team has to choose in total three tunes, one from each and play the tunes. Different points will be allotted for different categories.\n\nCommon Rules:\n\nRound 1: Participation is in teams of one, two , three or four members, but no more. \n         Each team may use the given logistics which do not  include the microcontroller.\n         They have to arrange it  themselves.\n\n         In case any team is willing to enhance their design  with some other equipment,\n         they must inform the  event organizers beforehand for permission.\n\n\t No team is allowed any physical contact with the keyboard during performance time.\n\n\t There should be no pre-recorded tunes set on the keyboard.\n\nRound 2: Part I\n\t 9 tunes will be given of which three, one from each category (Easy, Average and Difficult) is to be played.\n\t \n\tThe maximum time each tune should take specified will be specified and taken into account while judging.\n\t\n\tPerformance will start with playing the first key and then the last or vice-versa of the toy keyboard \n\tfollowed by the three selected tunes\n\n\tThere must be synchronization of the finger with the keyboard keys.When the finger attached to the servo\n\tstrikes the key to be played on the toy keyboard, it should strike only that key and not strike the adjacent\n\tkeys as well. There should be minimum of such asynchronous key strikes.\n\n\tPart II\n\t15 min preparation time will be allotted to code and self-test the new tune given at the spot.\n\n\tAt the end of 15 min, no team can continue modifying or testing their code anymore. \n\t \n\tThis will be followed by the performance time of 2 min. Therefore the coded tune will be <=2 min.\n\n\tThere must be synchronization of the finger with the keyboard keys. When the finger attached to the servo\n\tstrikes the key to be played on the toy keyboard, it should strike only that key and not strike the adjacent\n\tkeys as well. There should be minimum of such asynchronous key strikes.\n\nNote: Finger-> The finger attached to the servo for playing they key.","event_max_team_number":"4","cat_name":"Mechatron","cat_id":"14","venue":"AB5 209","start_time":"13:00","end_time":"15:00","day":"2","date":"8-Oct-15","contact_name":"Sumeet Singh","contact_number":"7259613899"},{"id":"63","event_name":"Arm mark-2(Round 1)","event_id":"51","description":"Build a robotic arm and command the arm to complete the exciting challenges with just your wrist. Your very own Gesture Controlled Bot!\n\nDescription: \n\nRound1 : The participants are to pick 8 cubes from the arena within 5 minutes. The preparation time allowed is a maximum of 5 minutes. \n\nRound2 : The participants have to assemble a T ,Square and a Triangle , each comprising of 6, 8 and 9 cubes respectively. A maximum of 15 minutes total shall be allotted for all the three designs combined. The preparation time allowed is a maximum of 5 minutes.\nRules\n\n1)   Failing to prepare within the time allotted the participant shall face a penalty of 5% total \n\nmarks per minute.\n\n2)   No participant is allowed to touch the bot in any manner.\n\n3)   Only one person is to control the bot at a given time.\n\n4)   The bot must be gesture controlled. It can be wired or wireless.\n\n5)   The participants can modify upon the design taught at the workshop but the maximum \n\npower is to be limited at 12V 1A.\n\n6)   Power source shall be provided by the organizers.\n\n7)   The decision of the faculty judging shall be final and arguments to the contrary shall not \n\nbe entertained.\n\n8)   The second round shall be subdivided into 3 rounds. Weighted average for each round \n\nshall be calculated to declare the winner.\n\n9)   A team size of maximum 4 people is allowed.\n\n10) Bonus points shall be awarded as such : \n        CASE 1 : The participant has made the bot but has not coded it. Bonus of 30%\n\nCASE 2 : The participant has made the bot and has also coded it. Bonus of 40%","event_max_team_number":"4","cat_name":"Mechatron","cat_id":"14","venue":"AB5 401,402","start_time":"14:00","end_time":"17:00","day":"2","date":"8-Oct-15","contact_name":"Jitamanyu Goswami","contact_number":"7204093322"},{"id":"64","event_name":"Space Settlement (Round 2)","event_id":"62","description":"This event gives the opportunity to design a space settlement that are limited only by the confines of your mind (and science!). Dazzle us with your brilliance in an epic event whose scope is truly unparalleled.\nThe interested participants need to submit a proposal in pdf format on space settlement for 1000 inhabitants which have to include the following details:\n\nObjective of settlement.\nLocation of settlement.\nExternal structure with dimensions\nAllocation of internal areas\nProduction of pseudo gravity with calculations\nLife Support: water, air management.\n \nRules\n\nA team of maximum 4 members can participate. Individual participation is also allowed.  \nThe proposals submitted should be brief and precise.\nThe diagram of external structure should be either isometric view on EG sheets which is scanned and put in the pdf or 3D graphics done on any software.\nPlagiarised projects will be disqualified.\nSubmissions must relate to orbital settlements. Settlements should not be on a planet or moon. They must be permanent, relatively self-sufficient homes, not temporary work camps.\nThe deadline for submitting the project is 29 September,2015.\nSubmissions should be shared in the following drive along with contact details: settlement.tt15@gmail.com\n \nSelected teams will be called for round 1(questionnaire) and round2(on the spot situation) of tech tatva 2015.\n\nThe winners will be awarded with cash prizes.","event_max_team_number":"4","cat_name":"Open Category","cat_id":"18","venue":"NLH 105","start_time":"17:00","end_time":"19:00","day":"2","date":"8-Oct-15","contact_name":"Hazel Dhir","contact_number":"9591326638"},{"id":"65","event_name":"Articulture (Round 2)","event_id":"59","description":"Do you have what it takes to be a Bacteriartist? Throw away your acrylics and use bacteria to create your own micro-masterpiece to literally bring your art to life!!\n\nDescription:\n\nThe main aim of this event is to bring out all the artists out there and make them showcase their art using Bacteria. It's a creative and a technical event as without the technique, one can't grow the Bacteria properly and without one's creativity, one cannot win this competition.","event_max_team_number":"1","cat_name":"Open Category","cat_id":"18","venue":"Unit Operation Lab AB2","start_time":"14:00","end_time":"19:00","day":"2","date":"8-Oct-15","contact_name":"Mukund Kabbe","contact_number":"9986165580\n"},{"id":"66","event_name":"QI ( Round 1)","event_id":"58","description":"A Science and Technology Quiz designed to test participant's knowledge relating to the latest developments in Technology ,along with all things Science. Teams answer a series of questions spread over 2 rounds to be crowned winners.\n\nRound 1 : This is a written preliminary round, where all teams get a crack at the same set of questions. Teams will be eliminated based on their performance.\n\nRound 2 : The top 6 teams from Round 1 battle it out in the stage round to be crowned winners.\n\nRules :\na) A team can have a maximum of 3 members.\nb) The Quizmaster's decision is final and binding.","event_max_team_number":"3","cat_name":"Featured Event","cat_id":"17","venue":"NLH 103","start_time":"14:00","end_time":"16:00","day":"2","date":"8-Oct-15","contact_name":"Akhilesh Oberoi ","contact_number":"9740446188"},{"id":"67","event_name":"Chem E Car","event_id":"39","description":"Few things in practical chemistry are as exciting and interesting as watching a chemical reaction fuel actual movement. Experience the thrill of watching science at work, large and bright, right before your eyes. This TechTatva'15, we at Cheminova, invite you to bring your imagination to life and build your very own model car fueled by a chemical reaction.\n\nDescription:\n\nThe participants need to run a car using a chemical reaction. \n\nRound1: Aptitude test.\n\nRound2: Car launch.","event_max_team_number":"3","cat_name":"Cheminova","cat_id":"11","venue":"Machine Shop Road","start_time":"13:30","end_time":"17:00","day":"2","date":"8-Oct-15","contact_name":"Himanshu Shah","contact_number":"7259624347"},{"id":"68","event_name":"Algo Wars","event_id":"28","description":"Debate. Algorithm. Waste Management: Debate your way for efficient methods to clean your city, implement that thought in your design for your own algorithm to reduce waste reduction, play a part in the first step towards solving this issue.\n\nDescription:\n\nRound 1:Debate.\nBased on online study guides, every team will  give an on-stage speech for  7-minute on the topic at hand, followed by a debating session. \n\nRound2:  5 incomplete algorithms would be provided. These algorithms need to be corrected\/completed in the specified time. Each team can challenge the submitted solutions of other participants in the room by constructing test cases, in an attempt to generate erroneous output. The challenger receives points for a successful challenge (the challenged team loses all his points for that problem), and loses points for an unsuccessful challenge.","event_max_team_number":"2","cat_name":"Energia","cat_id":"7","venue":"AB5 208","start_time":"15:00","end_time":"17:00","day":"2","date":"8-Oct-15","contact_name":"Roli Khanna","contact_number":"9663553960"},{"id":"69","event_name":"Paper Presentation","event_id":"78","description":"TechTatva '15 invites the bright minds across this nation to present their ground breaking ideas and take part in the Technical Paper Presentation Competition hosted by MIT, Manipal. Every year around 400 talented individuals from various engineering streams participate and exhibit their ideas in front of our esteemed panel of judges.\nThe abstract must be original and should not break any copyright laws. Also, it must follow the IEEE format.\nThere is no restriction on the subject.\nDeadline for the submission of abstracts is 29 Sept, 2015.\nThere can be a team of maximum 4 participants.\nTime limit for presentation is 10 minutes.\nSend in your abstracts to both the id's:\npaperpresentation@techtatva.in\npaperpresentationtt15@gmail.com\nAll short listed candidates shall present their papers during TechTatva i.e within 7-10 Oct, 2015.\nDetails must contain :\nName of team mates .\nCollege Name\nTitle of Paper\nBranch of all participants.\n","event_max_team_number":"4","cat_name":"Featured Event","cat_id":"17","venue":"AB5 313,314,315,316","start_time":"14:00","end_time":"17:30","day":"2","date":"8-Oct-15","contact_name":"Dakshesh","contact_number":"9663584993"},{"id":"70","event_name":"Drag Race","event_id":"70","description":"\"The harder the struggle, the more glorious the triumph\"\nThe Sound only comparable to a monster Truck Rally that would make mozart wish he could hear again! Here's presenting the ultimate editions of the National Level RC Car championship, Fuel RC4. The Smell of burning rubber and nitro all swirling out together on race tracks with treacherous turns, ramps and obstacles; it's the perfect opportunity for all racing enthusiasts out there to witness the exhilarating speeds, stunts and highest level of racing! \n \nEvent stages:\n \nTime Attack : Speed and handling test. A race against the clock, with cars battling it out to finish with the best timings!\n \nDrag : Acceleration test. Two cars pitted against one another on a single stretch not only tests how fast the driver can drive but also how well he can handle his beauty.\n\nStunt mania : Multi-skill challenge. An obstacle race that pushes the limits of both cars and drivers to the breaking point!\n \nGran premio de manipal : The final leg of the championship where multiple drivers race on a single track of curvy turns and ramps to finish first often a matter of one-tenth of a second.\n","event_max_team_number":"4","cat_name":"Fuel RC4(Featured Event)","cat_id":"17","venue":"13th Block Stretch","start_time":"13:00","end_time":"20:00","day":"2","date":"8-Oct-15","contact_name":"Yash Agarwal","contact_number":"9740543986"},{"id":"72","event_name":"Robo Wars","event_id":"79","description":"It began with the strike of a hammer. The opponent tried to block it but failed. Outside the ring his controlled grappled with the joystick. Trying to bring it back into control. Yet Thor went on, smashing away with the force of a Viking God, blow after blow, bending steel and crushing metal. Thor's controller gunned away with fury, this was what it had all been about. Unquestioned victory. But it wasn't going to end now, and in a final try for victory the man outside the ring pressed a button, as the air filled with the sounds of whirring blades... \nThis was War. And only the best Robot would emerge in glory.\n","event_max_team_number":"7","cat_name":"Robo Wars","cat_id":"17","venue":"KC Arena","start_time":"17:00","end_time":"20:00","day":"2","date":"8-Oct-15","contact_name":"Satyam","contact_number":"9740646760"},{"id":"73","event_name":"Elucidate ( Round 1)","event_id":"67","description":"There are puzzles and then there are PUZZLES. Elucidate is the second kind. There is a lot of code breaking, cryptography, and some \"bang-your-head-on-the-table\" type of questions too! But that's not all! There will be mystery, drama (hopefully no action) and loads of comedy! Just get in here, take out your pencils (and your brains) and just...ELUCIDATE.","event_max_team_number":"3","cat_name":"ACUMEN","cat_id":"19","venue":"NLH 303 304","start_time":"13:30","end_time":"14:30","day":"3","date":"9\/10\/2015","contact_name":"Shileen S. Upadhyay\n","contact_number":"7795122400"},{"id":"74","event_name":"ATR ( Round 1)","event_id":"66","description":"An event where brains meet brawns!\nA fun filled event where you race against time and at the same time keep your cool as presence of mind is of utmost importance.\n\nDescription:\n\nRound 1 :  Screening test.\n\nRound 2 : Technical Treasure Hunt where students are given clues to different places across the campus and at each place they are asked to perform tasks with eliminations and detours.","event_max_team_number":"4","cat_name":"ACUMEN","cat_id":"19","venue":"NLH 303 304","start_time":"14:30","end_time":"15:30","day":"3","date":"9\/10\/2015","contact_name":"Abhigyan Sharma","contact_number":"9632676418"},{"id":"75","event_name":"MIQ ( Round 1)","event_id":"69","description":"Ever wondered what's your IQ? Where do u stand compared to others? If yes then MIQ it is to prove yourself.\n\nDescription:\n\nRound 1: Screening Test\n\nRound 2: There are 8 games which are aptitude based and requires smart and reasoning skills. Participants have to perform different situational tasks and one on one competitions will be there which involves knockouts and eliminations.","event_max_team_number":"1","cat_name":"ACUMEN","cat_id":"19","venue":"NLH 303 304","start_time":"15:30","end_time":"16:30","day":"3","date":"9\/10\/2015","contact_name":"M.Goheth Siddanth","contact_number":"9663604190"},{"id":"76","event_name":"AIB ( Round 2)","event_id":"65","description":"Pretty much everything that happens around us has some sound reason underlying it. The question is are you aware of them?This event pertains to testing your general awareness and how good you are at reasoning. Set aside all your engineering formulae and just stick to basics.\n\nDescription:\n\nRound 1 : Screening test.\n\nRound 2 : A video will be shown and participants are required to observe different phenomenas with reasoning.  Trial by Combat- a sub round, deals with reasoning of non-technical statements using existing laws of science and debating.","event_max_team_number":"2","cat_name":"ACUMEN","cat_id":"19","venue":"NLH 305","start_time":"14:00","end_time":"18:00","day":"3","date":"9\/10\/2015","contact_name":"KDS Chandan","contact_number":"7795122626"},{"id":"77","event_name":"No Strings attached ( Round 2)","event_id":"15","description":"Be Apollo for a day. Learn to make a harp using Arduino in our workshop and produce the needed harmonic sound by playing with the string of a laser light.","event_max_team_number":"3","cat_name":"ALACRITY","cat_id":"4","venue":"Electronics lab 1 &2 AB-5 Ground Floor ","start_time":"14:00","end_time":"17:30","day":"3","date":"9\/10\/2015","contact_name":"Nishant Dulani","contact_number":"7795175500"},{"id":"78","event_name":"Mazer Laser ( Round 2)","event_id":"14","description":"It gives a practical chance to play with the Laws of Reflection. Test your knowledge and reflect the laser to get the phasor.\n\nDescription:\n\nRound1: Screening test.\n\nRound2: The participants are expected to make mirror\/ lens arrangements between a beam of laser light and a pin hole camera so that it hits all the mirrors and reaches the camera.\nRound3: The participants have to make different geometric waveforms from the arrangement.","event_max_team_number":"3","cat_name":"ALACRITY","cat_id":"4","venue":"NLH 203","start_time":"16:00","end_time":"19:30","day":"3","date":"9\/10\/2015","contact_name":"Rishabh Mahajan","contact_number":"9663606723"},{"id":"79","event_name":"Fox Hunt ( Round 2)","event_id":"12","description":"An event wherein one can learn the actual working of an antenna and make their own models to find the treasure.\n\nDescription:\n\nRound1: Screening test.\n\nRound 2: Designing and building of an antenna followed by treasure hunt where transmitters of different frequencies are hidden in the places and the hidden devices have to be found out using that antenna.","event_max_team_number":"3","cat_name":"ALACRITY","cat_id":"4","venue":" Power Electronics Lab E&C","start_time":"13:30","end_time":"17:30","day":"3","date":"9\/10\/2015","contact_name":"G Abhishek Kumar Reddy ","contact_number":"9844312763"},{"id":"80","event_name":"Metal Trace ( Round 2)","event_id":"13","description":"As the name indicates, one needs to implement a fully functioning metal detector using 555 timer. This being an event, preceded by an all-inclusive workshop, is for those possessed by a drive to track down their prey.","event_max_team_number":"3","cat_name":"ALACRITY","cat_id":"4","venue":"In Front of ECE Dept AB5","start_time":"13:30","end_time":"17:30","day":"3","date":"9\/10\/2015","contact_name":"S.R.Raveena Kusumanchi","contact_number":"9880729507"},{"id":"81","event_name":"Think And Bid ( Round 1)","event_id":"24","description":"Think N Bid gives you an experience of real life bidding scenario.\n\n Description:\n\nRound 1: Screening test based on Business and IQ.\n\nRound 2: Different products would be shown along with a base price from where the bidding starts. While bidding, the teams have to keep in mind the fixed virtual money given to them and the best bid wins.","event_max_team_number":"3","cat_name":"BIZZMAESTRO","cat_id":"6","venue":"NLH 104 105","start_time":"13:30","end_time":"16:00","day":"3","date":"9\/10\/2015","contact_name":"M Priyadarshini Tripathy","contact_number":"7259624263"},{"id":"82","event_name":"Winner stands alone (Round 3)","event_id":"23","description":"This event is here to pick out the quickest and cleverest one of them all testing all the aspects of being a successful businessman. \n\nDescription:\n\nRound1: \"Strain your Brain\"?. Screening test.\n\nRound2: Each individual will be grouped into 5 teams of 4 people. A case study of 5 different individuals who perform menial jobs e.g. Chai Walla, domestic helper, auto driver etc. will be provided along with a detailed account on the lives of these individuals like their monthly salary, expenses, alternate sources of income, constraints. Keeping all of this in mind, the team has to make a \"5-year Plan of Action\" to make their current business more profitable.\n\nRound3: This round proves to be a splendid concoction of three events to test the swiftness of the mind, oratory, and improvisation skills of the contestants.","event_max_team_number":"1","cat_name":"BIZZMAESTRO","cat_id":"6","venue":"NLH 205","start_time":"18:00","end_time":"20:00","day":"3","date":"9\/10\/2015","contact_name":"Krsna Agrawal","contact_number":"7204083939"},{"id":"83","event_name":"Buzzinga (Round 2)","event_id":"21","description":"Buzzinga brings to you a wholesome experience of getting your start up, up and running and showcase your entrepreneurial skills by solving problems that you may face in the real world.\n\nDescription:\n\nRound1: Screening test\n\nRound 2: It has 2 sections. \nSection1:\nThis is the test of participants to work in groups and they have to come up with quality products based on the arbitrary resources provided to them. The participants need to keep the following in mind: \n1. The Innovation of the Product.\n2. The Cost Involved .\n3. The Market Capability.\nSection 2:\nOut of 12, only 5 teams will be selected. The selected teams have to attend a mock event where 3 kinds of investors are socializing: an angel investor, a venture capitalist and a seed investor, each having a fixed capital and a pre-set deal. The teams have to negotiate and lock down a deal with any one of them and the best deal wins.","event_max_team_number":"1","cat_name":"BIZZMAESTRO","cat_id":"6","venue":"D 304","start_time":"16:00","end_time":"20:00","day":"3","date":"9\/10\/2015","contact_name":"Divyeshakti Marwah","contact_number":"7829700576"},{"id":"84","event_name":"Industrialize ( Round 2)","event_id":"40","description":"Understand the fuel that powers the world. We invite you to envision and design your very own petroleum refinery.\n\nDescription:\n\nRound1: An aptitude test, based on logic, and basic science and math.\n\nRound2: The participants are provided with a fixed amount of capital and they are supposed to purchase suitable equipment within the budget, to build the ideal chemical plant from the provided resources.","event_max_team_number":"2","cat_name":"CHEMINOVA","cat_id":"11","venue":"D 307","start_time":"13:30","end_time":"17:00","day":"3","date":"9\/10\/2015","contact_name":"Amey Murur","contact_number":"9773006604"},{"id":"85","event_name":"Mayday","event_id":"32","description":"Mayday challenges you to identify the cause(s) of a historical air crash, through facts and evidence unearthed by officials in the investigations.\n\nDescription:\n\nRound1: Screening test\n\nRound2: Audio Visual Round. The participants are expected to analyze a sequence of events, leading to an aircraft disaster\/emergency and arrive on conclusions based on the evidence and data provided.","event_max_team_number":"2","cat_name":"AIRBORNE","cat_id":"9","venue":"AB5 302","start_time":"16:00","end_time":"19:00","day":"3","date":"9\/10\/2015","contact_name":"Anuj Arora","contact_number":"9663562083"},{"id":"86","event_name":"Make-O-Manipal ( Round 1)","event_id":"18","description":"Be more than just deal makers- Be a Dream Maker. \nEver thought of changing the position of AB5 or Food Court? Have you ever made a picture of your own campus in your mind? Make-O-Manipal provides a platform to plan the MIT campus in your own style. Concerned with the use of land, building stronger, greener and efficient campus? Replan-Remake-Rebuild to make the Manipal of your dreams.\n\nDescription:\n\nRound1: Participants have to make a virtual tender of a house. The tender will be divided into 4 sections i.e. slab, beam, column and walls.\n\nRound2: Participants will get a chance to re-plan 12 buildings of our MIT campus according to the given problem condition. ","event_max_team_number":"2","cat_name":"CONSTRUCTURE","cat_id":"5","venue":"NLH 203","start_time":"13:30","end_time":"15:30","day":"3","date":"9\/10\/2015","contact_name":"Prince Joshi","contact_number":"9916702513"},{"id":"87","event_name":"Concreation ( Round 2)","event_id":"16","description":"Survival of the strongest. \nConcrete, the DNA of modern construction, can turn mud to moulds, bricks to buildings, buildings to cities and cities to nations. Here we bring you a chance to learn the elementary practises in construction though a workshop and compete your way to cast the best building  blocks in teams of two.","event_max_team_number":"2","cat_name":"CONSTRUCTURE","cat_id":"5","venue":"MT LAB AB2","start_time":"15:30","end_time":"17:30","day":"3","date":"9\/10\/2015","contact_name":"Naman Jain","contact_number":"7795170606"},{"id":"88","event_name":"Peitho-Omada ( Round 3 )","event_id":"3","description":"It's time to code,but it's not just your coding skills that matter, it's the trust you have in your partner,the teamwork!\n\nDescription:\n\nRound1: It will be pen and paper, slides\/ output based questions. Teammates will be separated and asked to answer separately.\n\nRound2:  It will be code juggling. Simple programs will be given and teammates will have to write the code one after the other after a time slice.\n","event_max_team_number":"2","cat_name":"CRYPTOSS","cat_id":"1","venue":" NLH 204","start_time":"16:00","end_time":"19:00","day":"3","date":"9\/10\/2015","contact_name":"Utkarsh Bindal","contact_number":"9986665460"},{"id":"89","event_name":"Decepticode ( Round 2)","event_id":"1","description":"Prove yourself in Decepticode where your concepts, knowledge and aptitude will be thorougly tested with the help of an unknown programming language.\n\nDescription:\n\nRound1: It will have questions to test the candidate's logic and coding ability.\n\nRound2: Participants will be given a new programming language which they will need to learn on the spot and implement a given challenge using the given programming language.","event_max_team_number":"2","cat_name":"CRYPTOSS","cat_id":"1","venue":"CCF Lab","start_time":"13:30","end_time":"16:00","day":"3","date":"9\/10\/2015","contact_name":"Ashish Mehrotra\n","contact_number":"9663580466"},{"id":"90","event_name":"RoboMarathon","event_id":"48","description":"Design, build and race a Car controlled over Bluetooth based on Arduino. \n\nDescription:\n\nRound1 : Screening test on the basic concepts of sensors, remote sensing, and analog circuits.\n\nRound2: Building a  car and race it on the track provided.","event_max_team_number":"3","cat_name":"ELECTRIFIC","cat_id":"13","venue":" NLH 202 204","start_time":"14:00","end_time":"15:30","day":"3","date":"9\/10\/2015","contact_name":"Tuhin Bhattacharya","contact_number":"9980125170"},{"id":"91","event_name":"GET BUGGED (OR) DEBUG IT ( Round 2)","event_id":"46","description":"Solve the problem statement using circuit's components which will be provided on the spot. The competition comprises of designing of circuit, debugging of circuit using basic electronics knowledge. Are you wired to compete?\n\nDescription:\n\nRound1 : Screening test.\n\nRound2 : The participants will be given an output waveform and they have to design a circuit giving that desired output. ","event_max_team_number":"3","cat_name":"ELECTRIFIC","cat_id":"13","venue":" IE LAB AB1","start_time":"14:00","end_time":"18:00","day":"3","date":"9\/10\/2015","contact_name":"Vishal Sharma","contact_number":"9663579694"},{"id":"92","event_name":"Swades","event_id":"27","description":"Ever thought of a future city which is smart and energy efficient? Grab your chance to design your own city, relocate resources in the infrastructure of the city-in-hand, make it eco-friendly and exclusive! Go on, Imagine Away!\n\nDescription:\n\nRound 1: Treasure hunt-solve the clues to  reach the next destination and perform the task  in the shortest time.\n\nRound 2: Plan a city.","event_max_team_number":"2","cat_name":"ENERGIA","cat_id":"7","venue":"IC Backside","start_time":"13:00","end_time":"17:30","day":"3","date":"9\/10\/2015","contact_name":"Sushmita","contact_number":"9845567087"},{"id":"93","event_name":"Does your Grey Matter ( Round 2)","event_id":"61","description":"Play Fast! Play Smart! Does Your Grey Matter? \nEver imagined yourself in a TV quiz show? We bring to you an adapted version of the famous 90's show Going For Gold.\nSeize the opportunity to test your intelligence on various themes such as history, politics, art, science and technology and so on by answering quizzes and gear up for our final surprise.\n\nDescription:\n\nRound 1 : Screening test.\n\nRound 2 : Beat the Buzzer is a buzzer round followed by a Themed Rapid fire quiz.\n\nRound 3 : It has 2 parts.\n\na) Circuit Relay\nThe teams will have to build a particular circuit within a given time limit.\n\nb) Spot The Error.\nEach team will have to create a maximum of 7 errors in the given circuit. The circuits will then be exchanged among each other and the teams will have to identify the particular errors in the circuit within an allotted time.\n","event_max_team_number":"2","cat_name":"EPSILON","cat_id":"8","venue":"NLH 202","start_time":"17:00","end_time":"20:00","day":"3","date":"9\/10\/2015","contact_name":"Sudharshinee Goordoyal","contact_number":"7259612094"},{"id":"94","event_name":"Stunt Mania","event_id":"56","description":"Excelling in a race is hard, but winning it despite the hurdles is what matters the most. A series of obstacles tests not only the cars, but also the expertise of the driver.  This event, not only challenges the driver's skills but also tests the car built. So, Step up and join the league that beats the odds and races to win.","event_max_team_number":"1","cat_name":"FUEL RC 4","cat_id":"17","venue":"Quadrangle","start_time":"13:00","end_time":"17:00","day":"3","date":"9\/10\/2015","contact_name":"","contact_number":"0"},{"id":"95","event_name":"GP De Manipal","event_id":"57","description":"Things don't get any better than our Flagship Cup event. It is here here where racers get together, keen to practice their sport at the highest level, race against each other on a single track, ride for a winning position-often a matter of tenth of a second.","event_max_team_number":"6","cat_name":"FUEL RC 4","cat_id":"17","venue":"Quadrangle","start_time":"17:00","end_time":"20:00","day":"3","date":"9\/10\/2015","contact_name":"","contact_number":"0"},{"id":"97","event_name":"Devil Karters","event_id":"41","description":"Build your own GO-KART and enjoy your first kraftwagen.\n\nDescription:\n\nRound1 : Screening Test.\n\nRound2 : Basic Catia Training workshop.\n\nRound3 : The Designing and the Analysis: They will be given a day's time to design their own Kart on CATIA having the following major components:\na. Frame and steering\nb. Mountings\nc. Seat Frame\n\nRound4 : Each model is analyzed in Ansys and only top two teams get to fabricate the GO-KART.","event_max_team_number":"1","cat_name":"KRAFTWAGEN","cat_id":"12","venue":"Automobile Workshop","start_time":"13:00","end_time":"19:00","day":"3","date":"9\/10\/2015","contact_name":"Utkarsh Mehrotra","contact_number":"991689716"},{"id":"98","event_name":"Cad It Up ( Round 1)","event_id":"35","description":"All the CAD designers out there! Learn 3D designing software and work on isographic views and 3D modelling using Solid Edge Software.\nNo. of Rounds: 2","event_max_team_number":"2","cat_name":"MECHANIZE","cat_id":"10","venue":"CAD LAB, D-322","start_time":"14:30","end_time":"18:00","day":"3","date":"9\/10\/2015","contact_name":"PRIYADARSHAN","contact_number":"7259648362"},{"id":"99","event_name":"Recreate De vinci ( Round 1 and Round 2)","event_id":"34","description":"Recreate some of DaVinci's famous inventions to its best working condition.\n\nDescription:\n\nParticipants will be given kits and are required to make any one of Da Vinci Models and submit it within a given time period. They will be judged accordingly based on certain parameters.\nNo. of Rounds: 1","event_max_team_number":"3","cat_name":"MECHANIZE","cat_id":"10","venue":"D-309,D-310","start_time":"16:00","end_time":"19:00","day":"3","date":"9\/10\/2015","contact_name":"SRUTHI","contact_number":"9995564677"},{"id":"100","event_name":"Arm Mark 2 ( Round 2)","event_id":"51","description":"Build a robotic arm and command the arm to complete the exciting challenges with just your wrist. Your very own Gesture Controlled Bot!\n\nDescription: \n\nRound1 : The participants are to pick 8 cubes from the arena within 5 minutes. The preparation time allowed is a maximum of 5 minutes. \n\nRound2 : The participants have to assemble a T ,Square and a Triangle , each comprising of 6, 8 and 9 cubes respectively. A maximum of 15 minutes total shall be allotted for all the three designs combined. The preparation time allowed is a maximum of 5 minutes.\nRules\n\n1)   Failing to prepare within the time allotted the participant shall face a penalty of 5% total \n\nmarks per minute.\n\n2)   No participant is allowed to touch the bot in any manner.\n\n3)   Only one person is to control the bot at a given time.\n\n4)   The bot must be gesture controlled. It can be wired or wireless.\n\n5)   The participants can modify upon the design taught at the workshop but the maximum \n\npower is to be limited at 12V 1A.\n\n6)   Power source shall be provided by the organizers.\n\n7)   The decision of the faculty judging shall be final and arguments to the contrary shall not \n\nbe entertained.\n\n8)   The second round shall be subdivided into 3 rounds. Weighted average for each round \n\nshall be calculated to declare the winner.\n\n9)   A team size of maximum 4 people is allowed.\n\n10) Bonus points shall be awarded as such : \n        CASE 1 : The participant has made the bot but has not coded it. Bonus of 30%\n\nCASE 2 : The participant has made the bot and has also coded it. Bonus of 40%","event_max_team_number":"4","cat_name":"MECHATRON","cat_id":"14","venue":"AB5 405 406","start_time":"15:00","end_time":"18:00","day":"3","date":"9\/10\/2015","contact_name":"Jitamanyu Goswami","contact_number":"7204093322"},{"id":"101","event_name":"Robotic Piano Player ( Round 2)","event_id":"53","description":"Play the piano and dance to your own tunes as your own bot taps the keys, in accordance with your microcontroller coding skills and bot building technique.\nAlso, knowledge of any musical instrument is not a prerequisite.\n\nDescription:\n\nRound1: The models will be made to play any tune on a toy keyboard using the materials given and not any personal physical contact (like using fingers). So the playing of the keyboard will be automatic based on the programmed Arduino with mechanical and electrical equipment.\n\nRound2: Total of nine tunes will be offered, every three of these nine tunes belong to Easy, Average and Difficult Categories. Each team has to choose in total three tunes, one from each and play the tunes. Different points will be allotted for different categories.\n\nCommon Rules:\n\nRound 1: Participation is in teams of one, two , three or four members, but no more. \n         Each team may use the given logistics which do not  include the microcontroller.\n         They have to arrange it  themselves.\n\n         In case any team is willing to enhance their design  with some other equipment,\n         they must inform the  event organizers beforehand for permission.\n\n\t No team is allowed any physical contact with the keyboard during performance time.\n\n\t There should be no pre-recorded tunes set on the keyboard.\n\nRound 2: Part I\n\t 9 tunes will be given of which three, one from each category (Easy, Average and Difficult) is to be played.\n\t \n\tThe maximum time each tune should take specified will be specified and taken into account while judging.\n\t\n\tPerformance will start with playing the first key and then the last or vice-versa of the toy keyboard \n\tfollowed by the three selected tunes\n\n\tThere must be synchronization of the finger with the keyboard keys.When the finger attached to the servo\n\tstrikes the key to be played on the toy keyboard, it should strike only that key and not strike the adjacent\n\tkeys as well. There should be minimum of such asynchronous key strikes.\n\n\tPart II\n\t15 min preparation time will be allotted to code and self-test the new tune given at the spot.\n\n\tAt the end of 15 min, no team can continue modifying or testing their code anymore. \n\t \n\tThis will be followed by the performance time of 2 min. Therefore the coded tune will be <=2 min.\n\n\tThere must be synchronization of the finger with the keyboard keys. When the finger attached to the servo\n\tstrikes the key to be played on the toy keyboard, it should strike only that key and not strike the adjacent\n\tkeys as well. There should be minimum of such asynchronous key strikes.\n\nNote: Finger-> The finger attached to the servo for playing they key.","event_max_team_number":"4","cat_name":"MECHATRON","cat_id":"14","venue":"AB5 207","start_time":"13:00","end_time":"15:00","day":"3","date":"9\/10\/2015","contact_name":"Sumeet Singh","contact_number":"7259613899"},{"id":"102","event_name":"Paper Presentation","event_id":"78","description":"TechTatva '15 invites the bright minds across this nation to present their ground breaking ideas and take part in the Technical Paper Presentation Competition hosted by MIT, Manipal. Every year around 400 talented individuals from various engineering streams participate and exhibit their ideas in front of our esteemed panel of judges.\nThe abstract must be original and should not break any copyright laws. Also, it must follow the IEEE format.\nThere is no restriction on the subject.\nDeadline for the submission of abstracts is 29 Sept, 2015.\nThere can be a team of maximum 4 participants.\nTime limit for presentation is 10 minutes.\nSend in your abstracts to both the id's:\npaperpresentation@techtatva.in\npaperpresentationtt15@gmail.com\nAll short listed candidates shall present their papers during TechTatva i.e within 7-10 Oct, 2015.\nDetails must contain :\nName of team mates .\nCollege Name\nTitle of Paper\nBranch of all participants.\n","event_max_team_number":"4","cat_name":"PAPER PRESENTATION","cat_id":"17","venue":"AB5 313 314 315 316","start_time":"14:00","end_time":"17:30","day":"3","date":"9\/10\/2015","contact_name":"Dakshesh","contact_number":"9663584993"},{"id":"103","event_name":"Pirates","event_id":"10","description":"Race your bot through the deep waters terrorized by pirates and sea monsters. Navigate the surface crossing the iceberg and wrecked castle.\n\nDescription:\n\n Contestants will have to prepare a bot. There will be a race between two bots on water to reach the finish line encountering hurdles like thermocol monsters, icebergs, islands, big stones midway. Points will be deducted on touching these hurdles. Points will be given on how fast and proficiently a bot finishes the race.\n\nNOTE: \n1) Points will be deducted if one bot tries to obstruct the way of the other bot.\n2) Participants may use any mechanism to build a bot(eg. By using thermocol, plastic bottles, etc.).\n3) Bonus points will be awarded if the participants use wireless control.","event_max_team_number":"4","cat_name":"ROBOTREK","cat_id":"3","venue":"FC POOL","start_time":"14:00","end_time":"18:00","day":"3","date":"9\/10\/2015","contact_name":"Anurag Anand","contact_number":"9572328170"},{"id":"104","event_name":"Robo Wars","event_id":"79","description":"It began with the strike of a hammer. The opponent tried to block it but failed. Outside the ring his controlled grappled with the joystick. Trying to bring it back into control. Yet Thor went on, smashing away with the force of a Viking God, blow after blow, bending steel and crushing metal. Thor's controller gunned away with fury, this was what it had all been about. Unquestioned victory. But it wasn't going to end now, and in a final try for victory the man outside the ring pressed a button, as the air filled with the sounds of whirring blades... \nThis was War. And only the best Robot would emerge in glory.\n","event_max_team_number":"7","cat_name":"ROBOWARS","cat_id":"17","venue":"KC Area","start_time":"17:00","end_time":"20:00","day":"3","date":"9\/10\/2015","contact_name":"Satyam","contact_number":"9740646760"},{"id":"105","event_name":"Slice Of Life","event_id":"60","description":"Inspired by Dexter, Castle, Sherlock, other crime shows and novels, this Forensics and Biotech based event will be the perfect place to showcase your deduction skills. Come and work your little grey cells!\n\nDescription:\n\nRound 1 : Quiz on Forensics, Crime Scene Knowledge and on TV Shows which contain Murder\/Crime Solving as their main plotline.\n\nRound 2 : Each team will be given a Forensics Report along with a brief introduction to the Crime Scene with clues lying around. Using different tools at their disposal such as DNA Fingerprinting, pH tests, Blood Sampling etc., the participants need to investigate. After they have unraveled the clues,they will be given an idea of the suspects and eye witnesses and they will be allowed to question them. The teams will be graded upon correct use of Forensic Tools, correct questions used for deduction and total time taken for solving the case.","event_max_team_number":"4","cat_name":"SLICE OF LIFE","cat_id":"18","venue":"NLH 205","start_time":"13:30","end_time":"17:30","day":"3","date":"9\/10\/2015","contact_name":"Arun Kumar\n","contact_number":"7259648452"},{"id":"106","event_name":"ATR ( Round 2)","event_id":"66","description":"An event where brains meet brawns!\nA fun filled event where you race against time and at the same time keep your cool as presence of mind is of utmost importance.\n\nDescription:\n\nRound 1 :  Screening test.\n\nRound 2 : Technical Treasure Hunt where students are given clues to different places across the campus and at each place they are asked to perform tasks with eliminations and detours.","event_max_team_number":"4","cat_name":"ACUMEN","cat_id":"19","venue":"NLH 303","start_time":"15:00","end_time":"19:00","day":"4","date":"10\/10\/2015","contact_name":"Abhigyan Sharma","contact_number":"9632676418"},{"id":"107","event_name":"MIQ ( Round 2)","event_id":"69","description":"Ever wondered what's your IQ? Where do u stand compared to others? If yes then MIQ it is to prove yourself.\n\nDescription:\n\nRound 1: Screening Test\n\nRound 2: There are 8 games which are aptitude based and requires smart and reasoning skills. Participants have to perform different situational tasks and one on one competitions will be there which involves knockouts and eliminations.","event_max_team_number":"1","cat_name":"ACUMEN","cat_id":"19","venue":"NLH 304","start_time":"15:00","end_time":"19:00","day":"4","date":"10\/10\/2015","contact_name":"M.Goheth Siddanth","contact_number":"9663604190"},{"id":"108","event_name":"FOX HUNT ( Round 2)","event_id":"12","description":"An event wherein one can learn the actual working of an antenna and make their own models to find the treasure.\n\nDescription:\n\nRound1: Screening test.\n\nRound 2: Designing and building of an antenna followed by treasure hunt where transmitters of different frequencies are hidden in the places and the hidden devices have to be found out using that antenna.","event_max_team_number":"3","cat_name":"ALACRITY","cat_id":"4","venue":"POWER ELECTRONIC LAB E&C","start_time":"13:30","end_time":"15:00","day":"4","date":"10\/10\/2015","contact_name":"G Abhishek Kumar Reddy ","contact_number":"9844312763"},{"id":"109","event_name":"FOX HUNT ( Round 3)","event_id":"12","description":"An event wherein one can learn the actual working of an antenna and make their own models to find the treasure.\n\nDescription:\n\nRound1: Screening test.\n\nRound 2: Designing and building of an antenna followed by treasure hunt where transmitters of different frequencies are hidden in the places and the hidden devices have to be found out using that antenna.","event_max_team_number":"3","cat_name":"ALACRITY","cat_id":"4","venue":"CAMPUS","start_time":"15:30","end_time":"18:00","day":"4","date":"10\/10\/2015","contact_name":"G Abhishek Kumar Reddy ","contact_number":"9844312763"},{"id":"110","event_name":"MAKE-O-MANIPAL ( Round 2)","event_id":"18","description":"Be more than just deal makers- Be a Dream Maker. \nEver thought of changing the position of AB5 or Food Court? Have you ever made a picture of your own campus in your mind? Make-O-Manipal provides a platform to plan the MIT campus in your own style. Concerned with the use of land, building stronger, greener and efficient campus? Replan-Remake-Rebuild to make the Manipal of your dreams.\n\nDescription:\n\nRound1: Participants have to make a virtual tender of a house. The tender will be divided into 4 sections i.e. slab, beam, column and walls.\n\nRound2: Participants will get a chance to re-plan 12 buildings of our MIT campus according to the given problem condition. ","event_max_team_number":"2","cat_name":"CONSTRUCTURE","cat_id":"5","venue":"D-309 AB1","start_time":"13:00","end_time":"16:00","day":"4","date":"10\/10\/2015","contact_name":"Prince Joshi","contact_number":"9916702513"},{"id":"111","event_name":"THINK AND BID ( Round 2)","event_id":"24","description":"Think N Bid gives you an experience of real life bidding scenario.\n\n Description:\n\nRound 1: Screening test based on Business and IQ.\n\nRound 2: Different products would be shown along with a base price from where the bidding starts. While bidding, the teams have to keep in mind the fixed virtual money given to them and the best bid wins.","event_max_team_number":"3","cat_name":"BIZZMAESTRO","cat_id":"6","venue":"NLH 205","start_time":"16:00","end_time":"18:00","day":"4","date":"10\/10\/2015","contact_name":"M Priyadarshini Tripathy","contact_number":"7259624263"},{"id":"112","event_name":"JUNKYARD WARS ( Round 2)","event_id":"38","description":"Test your engineering skills and challenge your mind in this Mechanical Roller Coaster.\n\nDescription:\n\nThere will be 2 rounds in which the participants will be given 2 different problem statements based on which they will be required to build the mechanical structures using the materials provided in the time limit.","event_max_team_number":"3","cat_name":"MECHANIZE","cat_id":"10","venue":"AUTOMOBILE WORKSHOP","start_time":"14:00","end_time":"18:00","day":"4","date":"10\/10\/2015","contact_name":"KAUSHIK APTE","contact_number":"7795179333\n"},{"id":"113","event_name":"ELUCIDATE ( Round 2)","event_id":"67","description":"There are puzzles and then there are PUZZLES. Elucidate is the second kind. There is a lot of code breaking, cryptography, and some \"bang-your-head-on-the-table\" type of questions too! But that's not all! There will be mystery, drama (hopefully no action) and loads of comedy! Just get in here, take out your pencils (and your brains) and just...ELUCIDATE.","event_max_team_number":"3","cat_name":"ACUMEN","cat_id":"19","venue":"NLH 305","start_time":"15:00","end_time":"19:00","day":"4","date":"10\/10\/2015","contact_name":"Shileen S. Upadhyay\n","contact_number":"7795122400"},{"id":"115","event_name":"DEMONSTRATION PURPOSES","event_id":"1000","description":"","event_max_team_number":"0","cat_name":"OPEN","cat_id":"1000","venue":"KC AREA","start_time":"18:00","end_time":"20:00","day":"4","date":"10\/10\/2015","contact_name":"","contact_number":""},{"id":"116","event_name":"WATER ROCKET","event_id":"33","description":"Ever thought of making your own rocket, that too with a soft drink bottle and pressurized water! Well guess what, here is your chance, design your own innovative water propelled rocket using principles of propulsion, aerodynamics, projectile motion and feel your adrenaline rush. \n\nDescription:\n\nRound 1: The water rockets will be judged on design by the judges and their basic knowledge will be put to test.\n\nRound 2: The participants launch the rockets and their maximum range is judged.\n\nRound 3: This round judges the participant's knowledge about their rockets. Targets are set on the field and the participant hit it.","event_max_team_number":"4","cat_name":"AIR BORNE","cat_id":"9","venue":"QUADRANGLE","start_time":"14:30","end_time":"17:30","day":"4","date":"10\/10\/2015","contact_name":"Aditya Bajoria\n","contact_number":"9901306810"},{"id":"117","event_name":"FUN WITH PYTHON SCRIPTS","event_id":"7","description":"Think you are proficient in Python? \nThis event gives a platform for people to present their python scripts. Most innovative and useful script wins. Students will not only learn coding in python but also  to write scripts in python so that they can use their knowledge to solve everyday practical problems.","event_max_team_number":"1","cat_name":"TURING","cat_id":"20","venue":"NLH 204","start_time":"14:00","end_time":"17:00","day":"4","date":"10\/10\/2015","contact_name":"Purak Jain","contact_number":"7259646400"},{"id":"118","event_name":"URJA RACHNA","event_id":"26","description":"Here's your chance to make your own remote controlled LED Lamp! The catch is that it has to be power efficient, and unconventional. With a Pre-TechTatva workshop to brush the basics of building this structure, saving energy has never been so much fun before!","event_max_team_number":"3","cat_name":"ENRGIA","cat_id":"7","venue":"NLH 202","start_time":"18:00","end_time":"20:00","day":"4","date":"10\/10\/2015","contact_name":"Manoj Varma","contact_number":"9916884664"},{"id":"119","event_name":"BUZZINGA ( Round 2)","event_id":"21","description":"Buzzinga brings to you a wholesome experience of getting your start up, up and running and showcase your entrepreneurial skills by solving problems that you may face in the real world.\n\nDescription:\n\nRound1: Screening test\n\nRound 2: It has 2 sections. \nSection1:\nThis is the test of participants to work in groups and they have to come up with quality products based on the arbitrary resources provided to them. The participants need to keep the following in mind: \n1. The Innovation of the Product.\n2. The Cost Involved .\n3. The Market Capability.\nSection 2:\nOut of 12, only 5 teams will be selected. The selected teams have to attend a mock event where 3 kinds of investors are socializing: an angel investor, a venture capitalist and a seed investor, each having a fixed capital and a pre-set deal. The teams have to negotiate and lock down a deal with any one of them and the best deal wins.","event_max_team_number":"1","cat_name":"BIZZMAESTRO","cat_id":"6","venue":"D304 AB1","start_time":"13:30","end_time":"17:00","day":"4","date":"10\/10\/2015","contact_name":"Divyeshakti Marwah","contact_number":"7829700576"},{"id":"121","event_name":"CAD IT UP ( Round 2)","event_id":"35","description":"All the CAD designers out there! Learn 3D designing software and work on isographic views and 3D modelling using Solid Edge Software.\nNo. of Rounds: 2","event_max_team_number":"2","cat_name":"MECHANISE","cat_id":"10","venue":"CAD LAB","start_time":"15:30","end_time":"18:30","day":"4","date":"10\/10\/2015","contact_name":"PRIYADARSHAN","contact_number":"7259648362"},{"id":"122","event_name":"BATTLESHIP","event_id":"52","description":"It's war time and your nation needs you! Build your own part of a battleship and get ready to fire cannonballs. Bring out the 'Edward Kenway' in you and make your way to glory using your arsenal of mechanics and electronics.\n\nDescription: \n\nMake a ball launcher which provides projectile motion to a ball which hits as many targets as possible within three shots. The team that hits the most number of targets wins.\n\n1. Maximum Team size = 4\n\n2. The participants are free to use any material and components of their choice, both electrical and mechanical, but event heads or the organizers must be consulted.\n\n3.Maximum of 2 participants are allowed to be inside the arena while launching the ball.\n\n4.The size of the launcher should be under the limit of 50 x 32 inches.\n\n5.The force to launch the ball should be provided by only the launcher not by the participants. Participants are only allowed to trigger the launcher.\n\n6.The participants are not allowed to lift the launcher in their hands while launching the ball.\n\n7.The participants will be given a Cosco ball that they are supposed to launch.\n\n8.The targets will be 2 to 3 meters away from the launcher position.\n\n9.Once the ball is in motion, the ball should land beyond the 2 meters mark. If the participants fail to launch the ball beyond the line 2 thrice in total they loose their remaining chances.\n\n10. The participants can change the position of their launcher after every shot as long as it maintains 2 meters distance from the target and stay with the area provided for launcher.\n\n11. Use of explosives, pneumatics is not allowed.\n\n12. No DIY or any readymade kits are allowed.\n\n13. The Event Head holds the right to not let a team participate if their launcher is found dangerous to the participants, spectators or the environment.\n\n14.The judge's decision will be final and binding on the participants.\n\n15.The teams will be judged on number of targets they successfully hit.\n\n16.The teams can also earn points by adding complexity to the launcher.\n\n17.The breakup of total points is :\nDesign: 30%\nTarget Hits:70%","event_max_team_number":"4","cat_name":"MECHATRON","cat_id":"14","venue":"INFRONT OF FOODCOURT","start_time":"15:00","end_time":"19:00","day":"4","date":"10\/10\/2015","contact_name":"Kanishak Katahra","contact_number":"9916881967\n"},{"id":"123","event_name":"Mazer Laser ( Round 3)","event_id":"14","description":"It gives a practical chance to play with the Laws of Reflection. Test your knowledge and reflect the laser to get the phasor.\n\nDescription:\n\nRound1: Screening test.\n\nRound2: The participants are expected to make mirror\/ lens arrangements between a beam of laser light and a pin hole camera so that it hits all the mirrors and reaches the camera.\nRound3: The participants have to make different geometric waveforms from the arrangement.","event_max_team_number":"3","cat_name":"ALACRITY","cat_id":"4","venue":"NLH 203","start_time":"16:30","end_time":"20:00","day":"4","date":"10\/10\/2015","contact_name":"Rishabh Mahajan","contact_number":"9663606723"},{"id":"124","event_name":"ROAD RUNNER ( Round 2)","event_id":"19","description":"The road less travelled.  Speed through the set course using clues, each leading you to a new task. Each task is designed to test the scientific caliber, speed and knowledge of the commonly used surveying instruments.\n\nDescription:\n\nRound1: Each group of 2 is given a map with varied geological and physical features. The participants must be able to carve out the most efficient and economical roadway across the two mentioned points through appropriate instruments.\n\nRound 2: The qualified teams will have to compete against each other in this time-based event. They will have to use the readings of the surveying instruments at a given location at the next location.","event_max_team_number":"2","cat_name":"CONSTRUCTURE","cat_id":"5","venue":"CHEMICAL DEPT Y-ROAD","start_time":"15:00","end_time":"18:00","day":"4","date":"10\/10\/2015","contact_name":"Sreya Nayani","contact_number":"7795178686"},{"id":"125","event_name":"ROBO MARATHON ( Round 2)","event_id":"48","description":"Design, build and race a Car controlled over Bluetooth based on Arduino. \n\nDescription:\n\nRound1 : Screening test on the basic concepts of sensors, remote sensing, and analog circuits.\n\nRound2: Building a  car and race it on the track provided.","event_max_team_number":"3","cat_name":"ELECTRIFIC","cat_id":"13","venue":"MICROCONTROLLER LAB","start_time":"14:00","end_time":"18:00","day":"4","date":"10\/10\/2015","contact_name":"Tuhin Bhattacharya","contact_number":"9980125170"},{"id":"126","event_name":"DOES YOUR GREY MATTER ( Round 3)","event_id":"61","description":"Play Fast! Play Smart! Does Your Grey Matter? \nEver imagined yourself in a TV quiz show? We bring to you an adapted version of the famous 90's show Going For Gold.\nSeize the opportunity to test your intelligence on various themes such as history, politics, art, science and technology and so on by answering quizzes and gear up for our final surprise.\n\nDescription:\n\nRound 1 : Screening test.\n\nRound 2 : Beat the Buzzer is a buzzer round followed by a Themed Rapid fire quiz.\n\nRound 3 : It has 2 parts.\n\na) Circuit Relay\nThe teams will have to build a particular circuit within a given time limit.\n\nb) Spot The Error.\nEach team will have to create a maximum of 7 errors in the given circuit. The circuits will then be exchanged among each other and the teams will have to identify the particular errors in the circuit within an allotted time.\n","event_max_team_number":"2","cat_name":"EPSILON","cat_id":"8","venue":"BIO MED DE LAB","start_time":"14:00","end_time":"17:00","day":"4","date":"10\/10\/2015","contact_name":"Sudharshinee Goordoyal","contact_number":"7259612094"},{"id":"127","event_name":"PAPER PRESENTATION","event_id":"78","description":"TechTatva '15 invites the bright minds across this nation to present their ground breaking ideas and take part in the Technical Paper Presentation Competition hosted by MIT, Manipal. Every year around 400 talented individuals from various engineering streams participate and exhibit their ideas in front of our esteemed panel of judges.\nThe abstract must be original and should not break any copyright laws. Also, it must follow the IEEE format.\nThere is no restriction on the subject.\nDeadline for the submission of abstracts is 29 Sept, 2015.\nThere can be a team of maximum 4 participants.\nTime limit for presentation is 10 minutes.\nSend in your abstracts to both the id's:\npaperpresentation@techtatva.in\npaperpresentationtt15@gmail.com\nAll short listed candidates shall present their papers during TechTatva i.e within 7-10 Oct, 2015.\nDetails must contain :\nName of team mates .\nCollege Name\nTitle of Paper\nBranch of all participants.\n","event_max_team_number":"4","cat_name":"FEATURED EVENT","cat_id":"17","venue":"AB5 313,314,315,316","start_time":"14:00","end_time":"17:30","day":"4","date":"10\/10\/2015","contact_name":"Dakshesh","contact_number":"9663584993"},{"id":"128","event_name":"QI ( Round 2)","event_id":"58","description":"A Science and Technology Quiz designed to test participant's knowledge relating to the latest developments in Technology ,along with all things Science. Teams answer a series of questions spread over 2 rounds to be crowned winners.\n\nRound 1 : This is a written preliminary round, where all teams get a crack at the same set of questions. Teams will be eliminated based on their performance.\n\nRound 2 : The top 6 teams from Round 1 battle it out in the stage round to be crowned winners.\n\nRules :\na) A team can have a maximum of 3 members.\nb) The Quizmaster's decision is final and binding.","event_max_team_number":"3","cat_name":"FEATURED EVENT","cat_id":"17","venue":"AC SEMINAR HALL","start_time":"13:30","end_time":"16:30","day":"4","date":"","contact_name":"Akhilesh Oberoi ","contact_number":"9740446188"},{"id":"129","event_name":"AIR GUN","event_id":"37","description":"Single round event, wherein the participants will be given a kit prior to the event containing necessary items to build an air gun and design an indigenous trigger mechanism for their prototype and present it on the event day for judgment.","event_max_team_number":"3","cat_name":"MECHANIZE","cat_id":"10","venue":"BOOK BANK AREA","start_time":"15:30","end_time":"18:30","day":"1","date":"","contact_name":"NILAY ATUL KULKARNI","contact_number":"9538912388\n"},{"id":"130","event_name":"SPRINT RACE ","event_id":"0","description":"","event_max_team_number":"0","cat_name":"FUEL RC 4","cat_id":"17","venue":"13 BLOCK STRETCH","start_time":"13:00","end_time":"20:00","day":"1","date":"","contact_name":"","contact_number":""},{"id":"131","event_name":"Counter Strike: Global Offensive","event_id":"71","description":"Counter-Strike: Global Offensive (often abbreviated as CS:GO) is an online tactical \n\nfirst-person shooter developed by Valve Corporation and Hidden Path Entertainment. Global Offensive is an objective-based multiplayer first-person \nshooter. Each player joins either the Terrorist or Counter-Terrorist team and \nattempts to complete objectives or eliminate the enemy team. Players purchase weapons and equipment at the beginning of every round with money awarded based on their performance. Completing objectives or killing enemies earns the player money while negative actions, like killing a teammate or hostage, takes money away from the player. In addition, when a round ends all players receive some amount of money, with players on the winning team receiving substantially more.\n-> Each team of 5 players with a Team Captain\n\n-> Players are required to bring their own mouse and other peripherals\n\nRules:\n\nCompetition Method: 5 vs. 5 (Team Play, 5 players per team)\nTournament Format : Single Elimination\nGame Mode : Competitive\nGeneral Competitive settings will be used with a few exceptions.\nRound Time: 1 minute 45 seconds\nC4 Timer : 35 Seconds\nBuy Time : 12 Seconds\nFreeze Time : 7 Seconds\nStarting Money : $800\n1st round\nMap : De_dust2\nVictory Condition : The first team to score 12 rounds.\n2nd Round\nMap : De_Inferno\nVictory Condition : The first team to score 12 rounds.\nThereafter a Best of Three map format will be used.\nRounds: 30 Rounds (Max rounds format) 15 rounds as Terrorists and 15 rounds as Counter-Terrorists per team.\nSides: (Counter-Terrorist \/ Terrorist) decided by a coin toss\/Knife round.\nVictory Condition: The first team to score 16 rounds.\nMap Pool :\n• De_Dust2\n• De_Inferno\n• De_Nuke\n• De_Mirage\n• De_Cache\n\nUnfair Play\nThe following actions will be considered unfair play:\n• The use of any cheat program and\/or map hack program\n• An intentional disconnection\n• The use of any settings exceeding the standard and permitted settings\n• Use of any unapproved textures or models - Only default CSGO models will be allowed\n• Any intentional abuse of \"pause\" by a Player on the server","event_max_team_number":"5","cat_name":"Gaming","cat_id":"16","venue":"NLH 402,403,404,405","start_time":"14:00","end_time":"20:00","day":"1","date":"7-Oct","contact_name":"Rahul Pathak","contact_number":"9916890353"},{"id":"132","event_name":"Counter Strike: Global Offensive","event_id":"71","description":"Counter-Strike: Global Offensive (often abbreviated as CS:GO) is an online tactical \n\nfirst-person shooter developed by Valve Corporation and Hidden Path Entertainment. Global Offensive is an objective-based multiplayer first-person \nshooter. Each player joins either the Terrorist or Counter-Terrorist team and \nattempts to complete objectives or eliminate the enemy team. Players purchase weapons and equipment at the beginning of every round with money awarded based on their performance. Completing objectives or killing enemies earns the player money while negative actions, like killing a teammate or hostage, takes money away from the player. In addition, when a round ends all players receive some amount of money, with players on the winning team receiving substantially more.\n-> Each team of 5 players with a Team Captain\n\n-> Players are required to bring their own mouse and other peripherals\n\nRules:\n\nCompetition Method: 5 vs. 5 (Team Play, 5 players per team)\nTournament Format : Single Elimination\nGame Mode : Competitive\nGeneral Competitive settings will be used with a few exceptions.\nRound Time: 1 minute 45 seconds\nC4 Timer : 35 Seconds\nBuy Time : 12 Seconds\nFreeze Time : 7 Seconds\nStarting Money : $800\n1st round\nMap : De_dust2\nVictory Condition : The first team to score 12 rounds.\n2nd Round\nMap : De_Inferno\nVictory Condition : The first team to score 12 rounds.\nThereafter a Best of Three map format will be used.\nRounds: 30 Rounds (Max rounds format) 15 rounds as Terrorists and 15 rounds as Counter-Terrorists per team.\nSides: (Counter-Terrorist \/ Terrorist) decided by a coin toss\/Knife round.\nVictory Condition: The first team to score 16 rounds.\nMap Pool :\n• De_Dust2\n• De_Inferno\n• De_Nuke\n• De_Mirage\n• De_Cache\n\nUnfair Play\nThe following actions will be considered unfair play:\n• The use of any cheat program and\/or map hack program\n• An intentional disconnection\n• The use of any settings exceeding the standard and permitted settings\n• Use of any unapproved textures or models - Only default CSGO models will be allowed\n• Any intentional abuse of \"pause\" by a Player on the server","event_max_team_number":"5","cat_name":"Gaming","cat_id":"16","venue":"NLH 402,403,404,405","start_time":"14:00","end_time":"20:00","day":"2","date":"8-Oct","contact_name":"Rahul Pathak","contact_number":"9916890353"},{"id":"133","event_name":"Counter Strike: Global Offensive","event_id":"71","description":"Counter-Strike: Global Offensive (often abbreviated as CS:GO) is an online tactical \n\nfirst-person shooter developed by Valve Corporation and Hidden Path Entertainment. Global Offensive is an objective-based multiplayer first-person \nshooter. Each player joins either the Terrorist or Counter-Terrorist team and \nattempts to complete objectives or eliminate the enemy team. Players purchase weapons and equipment at the beginning of every round with money awarded based on their performance. Completing objectives or killing enemies earns the player money while negative actions, like killing a teammate or hostage, takes money away from the player. In addition, when a round ends all players receive some amount of money, with players on the winning team receiving substantially more.\n-> Each team of 5 players with a Team Captain\n\n-> Players are required to bring their own mouse and other peripherals\n\nRules:\n\nCompetition Method: 5 vs. 5 (Team Play, 5 players per team)\nTournament Format : Single Elimination\nGame Mode : Competitive\nGeneral Competitive settings will be used with a few exceptions.\nRound Time: 1 minute 45 seconds\nC4 Timer : 35 Seconds\nBuy Time : 12 Seconds\nFreeze Time : 7 Seconds\nStarting Money : $800\n1st round\nMap : De_dust2\nVictory Condition : The first team to score 12 rounds.\n2nd Round\nMap : De_Inferno\nVictory Condition : The first team to score 12 rounds.\nThereafter a Best of Three map format will be used.\nRounds: 30 Rounds (Max rounds format) 15 rounds as Terrorists and 15 rounds as Counter-Terrorists per team.\nSides: (Counter-Terrorist \/ Terrorist) decided by a coin toss\/Knife round.\nVictory Condition: The first team to score 16 rounds.\nMap Pool :\n• De_Dust2\n• De_Inferno\n• De_Nuke\n• De_Mirage\n• De_Cache\n\nUnfair Play\nThe following actions will be considered unfair play:\n• The use of any cheat program and\/or map hack program\n• An intentional disconnection\n• The use of any settings exceeding the standard and permitted settings\n• Use of any unapproved textures or models - Only default CSGO models will be allowed\n• Any intentional abuse of \"pause\" by a Player on the server","event_max_team_number":"5","cat_name":"Gaming","cat_id":"16","venue":"NLH 402,403,404,405","start_time":"14:00","end_time":"20:00","day":"3","date":"9-Oct","contact_name":"Rahul Pathak","contact_number":"9916890353"},{"id":"134","event_name":"Counter Strike: Global Offensive","event_id":"71","description":"Counter-Strike: Global Offensive (often abbreviated as CS:GO) is an online tactical \n\nfirst-person shooter developed by Valve Corporation and Hidden Path Entertainment. Global Offensive is an objective-based multiplayer first-person \nshooter. Each player joins either the Terrorist or Counter-Terrorist team and \nattempts to complete objectives or eliminate the enemy team. Players purchase weapons and equipment at the beginning of every round with money awarded based on their performance. Completing objectives or killing enemies earns the player money while negative actions, like killing a teammate or hostage, takes money away from the player. In addition, when a round ends all players receive some amount of money, with players on the winning team receiving substantially more.\n-> Each team of 5 players with a Team Captain\n\n-> Players are required to bring their own mouse and other peripherals\n\nRules:\n\nCompetition Method: 5 vs. 5 (Team Play, 5 players per team)\nTournament Format : Single Elimination\nGame Mode : Competitive\nGeneral Competitive settings will be used with a few exceptions.\nRound Time: 1 minute 45 seconds\nC4 Timer : 35 Seconds\nBuy Time : 12 Seconds\nFreeze Time : 7 Seconds\nStarting Money : $800\n1st round\nMap : De_dust2\nVictory Condition : The first team to score 12 rounds.\n2nd Round\nMap : De_Inferno\nVictory Condition : The first team to score 12 rounds.\nThereafter a Best of Three map format will be used.\nRounds: 30 Rounds (Max rounds format) 15 rounds as Terrorists and 15 rounds as Counter-Terrorists per team.\nSides: (Counter-Terrorist \/ Terrorist) decided by a coin toss\/Knife round.\nVictory Condition: The first team to score 16 rounds.\nMap Pool :\n• De_Dust2\n• De_Inferno\n• De_Nuke\n• De_Mirage\n• De_Cache\n\nUnfair Play\nThe following actions will be considered unfair play:\n• The use of any cheat program and\/or map hack program\n• An intentional disconnection\n• The use of any settings exceeding the standard and permitted settings\n• Use of any unapproved textures or models - Only default CSGO models will be allowed\n• Any intentional abuse of \"pause\" by a Player on the server","event_max_team_number":"5","cat_name":"Gaming","cat_id":"16","venue":"NLH 402,403,404,405","start_time":"14:00","end_time":"20:00","day":"4","date":"10-Oct","contact_name":"Rahul Pathak","contact_number":"9916890353"},{"id":"135","event_name":"Age of  Empires III","event_id":"72","description":"Age of Empires III is a real-time strategy video game developed by Microsoft Corporation's Ensemble Studios and published by Microsoft Game Studios. The game portrays the European colonization of the Americas, between approximately 1492 and 1850 AD. There are eight European civilizations to play within the game. Players begin with a constructed town center or a wagon that will build into such, an armed explorer, and a modest number of settlers. Players explore the map and begin gathering resources used to build additional units and buildings and to research upgrades or technologies. Actions such as training units, constructing buildings, killing enemy units etc., earn the player experience points. At certain experience point thresholds, players earn shipment cards that may be turned in for shipments from the players Home City, which can include units, an upgrade, or resources. The game progresses similar to most real-time strategy games until one side resigns or is eliminated.\n\nRules:\n\nGame type:Supremacy\nGame rules:Standard\nMap Style: Standard match\nLocation: \n1.Amazonia (first round)\n2.Texas (quarterfinals)\n3.Mongolia (semi-finals)\n4.Himalayas upper (finals)\n• Resources: Standard\n• Difficulty: Standard\n• Population Limit: 200\nStarting Age: Discovery Age\nVictory Condition: Time Limit (1100 years (1 hr))\nMap Size: Medium\nReveal Map: Normal\nGame Speed: Medium\nLock Teams: Enable\nCheats: Disable\nAll Tech: Disable\nNo wonders\nWalls and Towers are allowed.","event_max_team_number":"2","cat_name":"Gaming","cat_id":"16","venue":"NLH 402,403,404,405","start_time":"14:00","end_time":"20:00","day":"1","date":"7-Oct","contact_name":"Aditya Kini","contact_number":"8197580257"},{"id":"136","event_name":"Age of  Empires III","event_id":"72","description":"Age of Empires III is a real-time strategy video game developed by Microsoft Corporation's Ensemble Studios and published by Microsoft Game Studios. The game portrays the European colonization of the Americas, between approximately 1492 and 1850 AD. There are eight European civilizations to play within the game. Players begin with a constructed town center or a wagon that will build into such, an armed explorer, and a modest number of settlers. Players explore the map and begin gathering resources used to build additional units and buildings and to research upgrades or technologies. Actions such as training units, constructing buildings, killing enemy units etc., earn the player experience points. At certain experience point thresholds, players earn shipment cards that may be turned in for shipments from the players Home City, which can include units, an upgrade, or resources. The game progresses similar to most real-time strategy games until one side resigns or is eliminated.\n\nRules:\n\nGame type:Supremacy\nGame rules:Standard\nMap Style: Standard match\nLocation: \n1.Amazonia (first round)\n2.Texas (quarterfinals)\n3.Mongolia (semi-finals)\n4.Himalayas upper (finals)\n• Resources: Standard\n• Difficulty: Standard\n• Population Limit: 200\nStarting Age: Discovery Age\nVictory Condition: Time Limit (1100 years (1 hr))\nMap Size: Medium\nReveal Map: Normal\nGame Speed: Medium\nLock Teams: Enable\nCheats: Disable\nAll Tech: Disable\nNo wonders\nWalls and Towers are allowed.","event_max_team_number":"2","cat_name":"Gaming","cat_id":"16","venue":"NLH 402,403,404,405","start_time":"14:00","end_time":"20:00","day":"2","date":"8-Oct","contact_name":"Aditya Kini","contact_number":"8197580257"},{"id":"137","event_name":"Age of  Empires III","event_id":"72","description":"Age of Empires III is a real-time strategy video game developed by Microsoft Corporation's Ensemble Studios and published by Microsoft Game Studios. The game portrays the European colonization of the Americas, between approximately 1492 and 1850 AD. There are eight European civilizations to play within the game. Players begin with a constructed town center or a wagon that will build into such, an armed explorer, and a modest number of settlers. Players explore the map and begin gathering resources used to build additional units and buildings and to research upgrades or technologies. Actions such as training units, constructing buildings, killing enemy units etc., earn the player experience points. At certain experience point thresholds, players earn shipment cards that may be turned in for shipments from the players Home City, which can include units, an upgrade, or resources. The game progresses similar to most real-time strategy games until one side resigns or is eliminated.\n\nRules:\n\nGame type:Supremacy\nGame rules:Standard\nMap Style: Standard match\nLocation: \n1.Amazonia (first round)\n2.Texas (quarterfinals)\n3.Mongolia (semi-finals)\n4.Himalayas upper (finals)\n• Resources: Standard\n• Difficulty: Standard\n• Population Limit: 200\nStarting Age: Discovery Age\nVictory Condition: Time Limit (1100 years (1 hr))\nMap Size: Medium\nReveal Map: Normal\nGame Speed: Medium\nLock Teams: Enable\nCheats: Disable\nAll Tech: Disable\nNo wonders\nWalls and Towers are allowed.","event_max_team_number":"2","cat_name":"Gaming","cat_id":"16","venue":"NLH 402,403,404,405","start_time":"14:00","end_time":"20:00","day":"3","date":"9-Oct","contact_name":"Aditya Kini","contact_number":"8197580257"},{"id":"138","event_name":"Age of  Empires III","event_id":"72","description":"Age of Empires III is a real-time strategy video game developed by Microsoft Corporation's Ensemble Studios and published by Microsoft Game Studios. The game portrays the European colonization of the Americas, between approximately 1492 and 1850 AD. There are eight European civilizations to play within the game. Players begin with a constructed town center or a wagon that will build into such, an armed explorer, and a modest number of settlers. Players explore the map and begin gathering resources used to build additional units and buildings and to research upgrades or technologies. Actions such as training units, constructing buildings, killing enemy units etc., earn the player experience points. At certain experience point thresholds, players earn shipment cards that may be turned in for shipments from the players Home City, which can include units, an upgrade, or resources. The game progresses similar to most real-time strategy games until one side resigns or is eliminated.\n\nRules:\n\nGame type:Supremacy\nGame rules:Standard\nMap Style: Standard match\nLocation: \n1.Amazonia (first round)\n2.Texas (quarterfinals)\n3.Mongolia (semi-finals)\n4.Himalayas upper (finals)\n• Resources: Standard\n• Difficulty: Standard\n• Population Limit: 200\nStarting Age: Discovery Age\nVictory Condition: Time Limit (1100 years (1 hr))\nMap Size: Medium\nReveal Map: Normal\nGame Speed: Medium\nLock Teams: Enable\nCheats: Disable\nAll Tech: Disable\nNo wonders\nWalls and Towers are allowed.","event_max_team_number":"2","cat_name":"Gaming","cat_id":"16","venue":"NLH 402,403,404,405","start_time":"14:00","end_time":"20:00","day":"4","date":"10-Oct","contact_name":"Aditya Kini","contact_number":"8197580257"},{"id":"139","event_name":"Call of  Duty: Modern Warfare 3:","event_id":"73","description":"Call of Duty: Modern Warfare 3 is a 2011 first-person shooter political war thriller video game, developed by Infinity Ward and Sledgehammer Games. In this installment, the entire Killstreak reward system has been altered to make it more \ndifficult for players to get early unlocks. Killstreaks are now known as Pointstreak, and kills are no longer the only way to increase the player's Pointstreak. \nCompleting objectives such as planting a bomb or capturing a flag in s Capture the \nFlag awards points towards the player's Pointstreak. Pointstreak rewards are \norganized into three different \"strike packages\" called Assault, Support, and \nSpecialist. Each team of 5 players battles against another to win each round and accumulate Pointstreaks to win.\n\nRules:\n\nWeapon Restrictions\nPrimary weapons :\nNo semi automatic snipers. Only bolt action rifles(Intervention).No Riot Shield\nSecondary Weapons :\nOnly stinger in launchers. No shotguns no machine pistols,\nAttachments :\nNo Heartbeat sensor\nNo Akimbo\nNo Thermal\nNo Grenade Launchers\nNo shotgun\nLethal :\nONLY frag grenades, semtex, tactical insertion and throwing knife\nTactical :\nNo trophy system \nPerks :Tier 1\nAll except one man pro\nTier 2\nNo hardline, No cold blooded\nTier 3\nNo scrambler, No ninja pro, No last stand\nStrike packages :\nNo care package, No emergency airdrop\nDeath Streaks :\nOnly copycat\nGame Modes :\nFirst Round: headquarters. Semi-finals & Finals: Domination mode.\nBest of 3 map format.\nGeneral server settings :\nScore Limit : 500\nTime Limit : 10 minutes\nFriendly Fire is ON. Hardcore Mode is OFF ( No crosshair)\nRespawn Delay : 5 seconds","event_max_team_number":"5","cat_name":"Gaming","cat_id":"16","venue":"NLH 402,403,404,405","start_time":"14:00","end_time":"20:00","day":"1","date":"7-Oct","contact_name":"Pramita Johri","contact_number":"7406370777"},{"id":"140","event_name":"Call of  Duty: Modern Warfare 3:","event_id":"73","description":"Call of Duty: Modern Warfare 3 is a 2011 first-person shooter political war thriller video game, developed by Infinity Ward and Sledgehammer Games. In this installment, the entire Killstreak reward system has been altered to make it more \ndifficult for players to get early unlocks. Killstreaks are now known as Pointstreak, and kills are no longer the only way to increase the player's Pointstreak. \nCompleting objectives such as planting a bomb or capturing a flag in s Capture the \nFlag awards points towards the player's Pointstreak. Pointstreak rewards are \norganized into three different \"strike packages\" called Assault, Support, and \nSpecialist. Each team of 5 players battles against another to win each round and accumulate Pointstreaks to win.\n\nRules:\n\nWeapon Restrictions\nPrimary weapons :\nNo semi automatic snipers. Only bolt action rifles(Intervention).No Riot Shield\nSecondary Weapons :\nOnly stinger in launchers. No shotguns no machine pistols,\nAttachments :\nNo Heartbeat sensor\nNo Akimbo\nNo Thermal\nNo Grenade Launchers\nNo shotgun\nLethal :\nONLY frag grenades, semtex, tactical insertion and throwing knife\nTactical :\nNo trophy system \nPerks :Tier 1\nAll except one man pro\nTier 2\nNo hardline, No cold blooded\nTier 3\nNo scrambler, No ninja pro, No last stand\nStrike packages :\nNo care package, No emergency airdrop\nDeath Streaks :\nOnly copycat\nGame Modes :\nFirst Round: headquarters. Semi-finals & Finals: Domination mode.\nBest of 3 map format.\nGeneral server settings :\nScore Limit : 500\nTime Limit : 10 minutes\nFriendly Fire is ON. Hardcore Mode is OFF ( No crosshair)\nRespawn Delay : 5 seconds","event_max_team_number":"5","cat_name":"Gaming","cat_id":"16","venue":"NLH 402,403,404,405","start_time":"14:00","end_time":"20:00","day":"2","date":"8-Oct","contact_name":"Pramita Johri","contact_number":"7406370777"},{"id":"141","event_name":"Call of  Duty: Modern Warfare 3:","event_id":"73","description":"Call of Duty: Modern Warfare 3 is a 2011 first-person shooter political war thriller video game, developed by Infinity Ward and Sledgehammer Games. In this installment, the entire Killstreak reward system has been altered to make it more \ndifficult for players to get early unlocks. Killstreaks are now known as Pointstreak, and kills are no longer the only way to increase the player's Pointstreak. \nCompleting objectives such as planting a bomb or capturing a flag in s Capture the \nFlag awards points towards the player's Pointstreak. Pointstreak rewards are \norganized into three different \"strike packages\" called Assault, Support, and \nSpecialist. Each team of 5 players battles against another to win each round and accumulate Pointstreaks to win.\n\nRules:\n\nWeapon Restrictions\nPrimary weapons :\nNo semi automatic snipers. Only bolt action rifles(Intervention).No Riot Shield\nSecondary Weapons :\nOnly stinger in launchers. No shotguns no machine pistols,\nAttachments :\nNo Heartbeat sensor\nNo Akimbo\nNo Thermal\nNo Grenade Launchers\nNo shotgun\nLethal :\nONLY frag grenades, semtex, tactical insertion and throwing knife\nTactical :\nNo trophy system \nPerks :Tier 1\nAll except one man pro\nTier 2\nNo hardline, No cold blooded\nTier 3\nNo scrambler, No ninja pro, No last stand\nStrike packages :\nNo care package, No emergency airdrop\nDeath Streaks :\nOnly copycat\nGame Modes :\nFirst Round: headquarters. Semi-finals & Finals: Domination mode.\nBest of 3 map format.\nGeneral server settings :\nScore Limit : 500\nTime Limit : 10 minutes\nFriendly Fire is ON. Hardcore Mode is OFF ( No crosshair)\nRespawn Delay : 5 seconds","event_max_team_number":"5","cat_name":"Gaming","cat_id":"16","venue":"NLH 402,403,404,405","start_time":"14:00","end_time":"20:00","day":"3","date":"9-Oct","contact_name":"Pramita Johri","contact_number":"7406370777"},{"id":"142","event_name":"Call of  Duty: Modern Warfare 3:","event_id":"73","description":"Call of Duty: Modern Warfare 3 is a 2011 first-person shooter political war thriller video game, developed by Infinity Ward and Sledgehammer Games. In this installment, the entire Killstreak reward system has been altered to make it more \ndifficult for players to get early unlocks. Killstreaks are now known as Pointstreak, and kills are no longer the only way to increase the player's Pointstreak. \nCompleting objectives such as planting a bomb or capturing a flag in s Capture the \nFlag awards points towards the player's Pointstreak. Pointstreak rewards are \norganized into three different \"strike packages\" called Assault, Support, and \nSpecialist. Each team of 5 players battles against another to win each round and accumulate Pointstreaks to win.\n\nRules:\n\nWeapon Restrictions\nPrimary weapons :\nNo semi automatic snipers. Only bolt action rifles(Intervention).No Riot Shield\nSecondary Weapons :\nOnly stinger in launchers. No shotguns no machine pistols,\nAttachments :\nNo Heartbeat sensor\nNo Akimbo\nNo Thermal\nNo Grenade Launchers\nNo shotgun\nLethal :\nONLY frag grenades, semtex, tactical insertion and throwing knife\nTactical :\nNo trophy system \nPerks :Tier 1\nAll except one man pro\nTier 2\nNo hardline, No cold blooded\nTier 3\nNo scrambler, No ninja pro, No last stand\nStrike packages :\nNo care package, No emergency airdrop\nDeath Streaks :\nOnly copycat\nGame Modes :\nFirst Round: headquarters. Semi-finals & Finals: Domination mode.\nBest of 3 map format.\nGeneral server settings :\nScore Limit : 500\nTime Limit : 10 minutes\nFriendly Fire is ON. Hardcore Mode is OFF ( No crosshair)\nRespawn Delay : 5 seconds","event_max_team_number":"5","cat_name":"Gaming","cat_id":"16","venue":"NLH 402,403,404,405","start_time":"14:00","end_time":"20:00","day":"4","date":"10-Oct","contact_name":"Pramita Johri","contact_number":"7406370777"},{"id":"143","event_name":"Need for Speed: Most Wanted","event_id":"74","description":"Need for Speed: Most Wanted (commonly abbreviated to as NFS: MW or just \nMost Wanted) is a racing video game developed by EA Black Box and published by Electronic Arts. It is the ninth installment in the Need for Speed series. The game features street racing-oriented game play, with certain customization options. Most Wanted is like other Need for Speed games, where the player selects one \ncar and races against a time limit or other racers to reach a destination. The \ngame's four existing modes: Circuit races, point-to-point Sprint races, lap \nknockout races and Drag races distinguish the true champion. Each player gets to choose their car and upgrade is as per requirement. The winner moves on to further rounds.\n\nRules:\n\nTiming will be noted to decide the winner.\nIn case of tie, a tie breaker race of any type may be conducted until it is resolved.\nTrack Direction: Forward\nPerformance Matching: Off\nCollision: Off\nJunkyard Upgrades not allowed\nNitrous Allowed\nOnly Stock Cars with in game upgrades are to be used.\nTime to select and tune cars: 5 min.\n1.Elimination:\n->Sprint Map: Diamond Valley\n2.Quarter Finals\n->Sprint Map: Stadium & Hwy99\n->Circuit Map: Heritage & Omega\n3.Semi Finals\n->Sprint Maps\nCamden & Route 55\nHeritage & Campus\n->Circuit Maps\nDunwich Bay\nHeritage & Omega\n4.FINALS\n->Sprint Maps\nSeaside & Lennox\nStadium & Hwy99\n->Circuit Maps\nHeritage Heights\nDiamond\n->Drag Map\nHeritage and Rosewood","event_max_team_number":"1","cat_name":"Gaming","cat_id":"16","venue":"NLH 402,403,404,405","start_time":"14:00","end_time":"20:00","day":"1","date":"7-Oct","contact_name":"Tanish Gupta","contact_number":"9663562139"},{"id":"144","event_name":"Need for Speed: Most Wanted","event_id":"74","description":"Need for Speed: Most Wanted (commonly abbreviated to as NFS: MW or just \nMost Wanted) is a racing video game developed by EA Black Box and published by Electronic Arts. It is the ninth installment in the Need for Speed series. The game features street racing-oriented game play, with certain customization options. Most Wanted is like other Need for Speed games, where the player selects one \ncar and races against a time limit or other racers to reach a destination. The \ngame's four existing modes: Circuit races, point-to-point Sprint races, lap \nknockout races and Drag races distinguish the true champion. Each player gets to choose their car and upgrade is as per requirement. The winner moves on to further rounds.\n\nRules:\n\nTiming will be noted to decide the winner.\nIn case of tie, a tie breaker race of any type may be conducted until it is resolved.\nTrack Direction: Forward\nPerformance Matching: Off\nCollision: Off\nJunkyard Upgrades not allowed\nNitrous Allowed\nOnly Stock Cars with in game upgrades are to be used.\nTime to select and tune cars: 5 min.\n1.Elimination:\n->Sprint Map: Diamond Valley\n2.Quarter Finals\n->Sprint Map: Stadium & Hwy99\n->Circuit Map: Heritage & Omega\n3.Semi Finals\n->Sprint Maps\nCamden & Route 55\nHeritage & Campus\n->Circuit Maps\nDunwich Bay\nHeritage & Omega\n4.FINALS\n->Sprint Maps\nSeaside & Lennox\nStadium & Hwy99\n->Circuit Maps\nHeritage Heights\nDiamond\n->Drag Map\nHeritage and Rosewood","event_max_team_number":"1","cat_name":"Gaming","cat_id":"16","venue":"NLH 402,403,404,405","start_time":"14:00","end_time":"20:00","day":"2","date":"8-Oct","contact_name":"Tanish Gupta","contact_number":"9663562139"},{"id":"145","event_name":"Need for Speed: Most Wanted","event_id":"74","description":"Need for Speed: Most Wanted (commonly abbreviated to as NFS: MW or just \nMost Wanted) is a racing video game developed by EA Black Box and published by Electronic Arts. It is the ninth installment in the Need for Speed series. The game features street racing-oriented game play, with certain customization options. Most Wanted is like other Need for Speed games, where the player selects one \ncar and races against a time limit or other racers to reach a destination. The \ngame's four existing modes: Circuit races, point-to-point Sprint races, lap \nknockout races and Drag races distinguish the true champion. Each player gets to choose their car and upgrade is as per requirement. The winner moves on to further rounds.\n\nRules:\n\nTiming will be noted to decide the winner.\nIn case of tie, a tie breaker race of any type may be conducted until it is resolved.\nTrack Direction: Forward\nPerformance Matching: Off\nCollision: Off\nJunkyard Upgrades not allowed\nNitrous Allowed\nOnly Stock Cars with in game upgrades are to be used.\nTime to select and tune cars: 5 min.\n1.Elimination:\n->Sprint Map: Diamond Valley\n2.Quarter Finals\n->Sprint Map: Stadium & Hwy99\n->Circuit Map: Heritage & Omega\n3.Semi Finals\n->Sprint Maps\nCamden & Route 55\nHeritage & Campus\n->Circuit Maps\nDunwich Bay\nHeritage & Omega\n4.FINALS\n->Sprint Maps\nSeaside & Lennox\nStadium & Hwy99\n->Circuit Maps\nHeritage Heights\nDiamond\n->Drag Map\nHeritage and Rosewood","event_max_team_number":"1","cat_name":"Gaming","cat_id":"16","venue":"NLH 402,403,404,405","start_time":"14:00","end_time":"20:00","day":"3","date":"9-Oct","contact_name":"Tanish Gupta","contact_number":"9663562139"},{"id":"146","event_name":"Need for Speed: Most Wanted","event_id":"74","description":"Need for Speed: Most Wanted (commonly abbreviated to as NFS: MW or just \nMost Wanted) is a racing video game developed by EA Black Box and published by Electronic Arts. It is the ninth installment in the Need for Speed series. The game features street racing-oriented game play, with certain customization options. Most Wanted is like other Need for Speed games, where the player selects one \ncar and races against a time limit or other racers to reach a destination. The \ngame's four existing modes: Circuit races, point-to-point Sprint races, lap \nknockout races and Drag races distinguish the true champion. Each player gets to choose their car and upgrade is as per requirement. The winner moves on to further rounds.\n\nRules:\n\nTiming will be noted to decide the winner.\nIn case of tie, a tie breaker race of any type may be conducted until it is resolved.\nTrack Direction: Forward\nPerformance Matching: Off\nCollision: Off\nJunkyard Upgrades not allowed\nNitrous Allowed\nOnly Stock Cars with in game upgrades are to be used.\nTime to select and tune cars: 5 min.\n1.Elimination:\n->Sprint Map: Diamond Valley\n2.Quarter Finals\n->Sprint Map: Stadium & Hwy99\n->Circuit Map: Heritage & Omega\n3.Semi Finals\n->Sprint Maps\nCamden & Route 55\nHeritage & Campus\n->Circuit Maps\nDunwich Bay\nHeritage & Omega\n4.FINALS\n->Sprint Maps\nSeaside & Lennox\nStadium & Hwy99\n->Circuit Maps\nHeritage Heights\nDiamond\n->Drag Map\nHeritage and Rosewood","event_max_team_number":"1","cat_name":"Gaming","cat_id":"16","venue":"NLH 402,403,404,405","start_time":"14:00","end_time":"20:00","day":"4","date":"10-Oct","contact_name":"Tanish Gupta","contact_number":"9663562139"},{"id":"147","event_name":"FIFA 14","event_id":"75","description":"FIFA 14 is a 2013 sports association football simulation video game developed by EA Canada and published by Electronic Arts. Experience the emotion of scoring \ngreat goals in EA SPORTS FIFA 14. Feel the tension as chances are created, and \nexperience the thrill of hitting the back of the net. Each player gets to choose a team of their own and are then allowed to make necessary control changes and \nfiled modifications. Winner of each match proceeds to next round. Ties\/Draws are handled with Classic Modes (Extra Time) followed by Penalties in case of draw \nthere too.\n\nRules and Game settings :\n\nStandard game will be provided, no patches or transfer updates\n5 mins a half\nIn case of a Draw after Full Time: Extra time + Penalty\nNo custom formations\nNo Custom Tactics\nNo WORLD XI \/ CLASSIC XI\nCamera Mode : Tele\nRefree : ON\nRadar : 3D\nTeam Selection : 1 min\nSubstitutions : 2 min\nOffside : ON\nInjuries : OFF\nGame Speed : NORMAL\nDifficulty : WORLD CLASS\nDefending : Tactical Defending\nOnly Quarter-finals and Semi-Finals will be of 2 legs\nWeather : Clear\n\nCARRY YOUR OWN USB CONTROLLERS (WILL NOT BE PROVIDED).\nCARRY USB KEYBOARDS IF AVAILABLE.","event_max_team_number":"1","cat_name":"Gaming","cat_id":"16","venue":"NLH 402,403,404,405","start_time":"14:00","end_time":"20:00","day":"1","date":"7-Oct","contact_name":"Manan Sharma","contact_number":"7406345611"},{"id":"148","event_name":"FIFA 14","event_id":"75","description":"FIFA 14 is a 2013 sports association football simulation video game developed by EA Canada and published by Electronic Arts. Experience the emotion of scoring \ngreat goals in EA SPORTS FIFA 14. Feel the tension as chances are created, and \nexperience the thrill of hitting the back of the net. Each player gets to choose a team of their own and are then allowed to make necessary control changes and \nfiled modifications. Winner of each match proceeds to next round. Ties\/Draws are handled with Classic Modes (Extra Time) followed by Penalties in case of draw \nthere too.\n\nRules and Game settings :\n\nStandard game will be provided, no patches or transfer updates\n5 mins a half\nIn case of a Draw after Full Time: Extra time + Penalty\nNo custom formations\nNo Custom Tactics\nNo WORLD XI \/ CLASSIC XI\nCamera Mode : Tele\nRefree : ON\nRadar : 3D\nTeam Selection : 1 min\nSubstitutions : 2 min\nOffside : ON\nInjuries : OFF\nGame Speed : NORMAL\nDifficulty : WORLD CLASS\nDefending : Tactical Defending\nOnly Quarter-finals and Semi-Finals will be of 2 legs\nWeather : Clear\n\nCARRY YOUR OWN USB CONTROLLERS (WILL NOT BE PROVIDED).\nCARRY USB KEYBOARDS IF AVAILABLE.","event_max_team_number":"1","cat_name":"Gaming","cat_id":"16","venue":"NLH 402,403,404,405","start_time":"14:00","end_time":"20:00","day":"2","date":"8-Oct","contact_name":"Manan Sharma","contact_number":"7406345611"},{"id":"149","event_name":"FIFA 14","event_id":"75","description":"FIFA 14 is a 2013 sports association football simulation video game developed by EA Canada and published by Electronic Arts. Experience the emotion of scoring \ngreat goals in EA SPORTS FIFA 14. Feel the tension as chances are created, and \nexperience the thrill of hitting the back of the net. Each player gets to choose a team of their own and are then allowed to make necessary control changes and \nfiled modifications. Winner of each match proceeds to next round. Ties\/Draws are handled with Classic Modes (Extra Time) followed by Penalties in case of draw \nthere too.\n\nRules and Game settings :\n\nStandard game will be provided, no patches or transfer updates\n5 mins a half\nIn case of a Draw after Full Time: Extra time + Penalty\nNo custom formations\nNo Custom Tactics\nNo WORLD XI \/ CLASSIC XI\nCamera Mode : Tele\nRefree : ON\nRadar : 3D\nTeam Selection : 1 min\nSubstitutions : 2 min\nOffside : ON\nInjuries : OFF\nGame Speed : NORMAL\nDifficulty : WORLD CLASS\nDefending : Tactical Defending\nOnly Quarter-finals and Semi-Finals will be of 2 legs\nWeather : Clear\n\nCARRY YOUR OWN USB CONTROLLERS (WILL NOT BE PROVIDED).\nCARRY USB KEYBOARDS IF AVAILABLE.","event_max_team_number":"1","cat_name":"Gaming","cat_id":"16","venue":"NLH 402,403,404,405","start_time":"14:00","end_time":"20:00","day":"3","date":"9-Oct","contact_name":"Manan Sharma","contact_number":"7406345611"},{"id":"150","event_name":"FIFA 14","event_id":"75","description":"FIFA 14 is a 2013 sports association football simulation video game developed by EA Canada and published by Electronic Arts. Experience the emotion of scoring \ngreat goals in EA SPORTS FIFA 14. Feel the tension as chances are created, and \nexperience the thrill of hitting the back of the net. Each player gets to choose a team of their own and are then allowed to make necessary control changes and \nfiled modifications. Winner of each match proceeds to next round. Ties\/Draws are handled with Classic Modes (Extra Time) followed by Penalties in case of draw \nthere too.\n\nRules and Game settings :\n\nStandard game will be provided, no patches or transfer updates\n5 mins a half\nIn case of a Draw after Full Time: Extra time + Penalty\nNo custom formations\nNo Custom Tactics\nNo WORLD XI \/ CLASSIC XI\nCamera Mode : Tele\nRefree : ON\nRadar : 3D\nTeam Selection : 1 min\nSubstitutions : 2 min\nOffside : ON\nInjuries : OFF\nGame Speed : NORMAL\nDifficulty : WORLD CLASS\nDefending : Tactical Defending\nOnly Quarter-finals and Semi-Finals will be of 2 legs\nWeather : Clear\n\nCARRY YOUR OWN USB CONTROLLERS (WILL NOT BE PROVIDED).\nCARRY USB KEYBOARDS IF AVAILABLE.","event_max_team_number":"1","cat_name":"Gaming","cat_id":"16","venue":"NLH 402,403,404,405","start_time":"14:00","end_time":"20:00","day":"4","date":"10-Oct","contact_name":"Manan Sharma","contact_number":"7406345611"},{"id":"151","event_name":"Defense Of  The Ancients II","event_id":"76","description":"Dota 2 is a multiplayer online battle arena video game, the stand-alone sequel to the Defense of the Ancients (DotA), developed by Valve Corporation. Dota 2 is played in matches involving two teams of five players, each of which occupies a \nstronghold at a corner of the map. Each stronghold contains a building called the \"Ancient\", which the opposite team must destroy to win the match. Each player \ncontrols a \"Hero\" character and focuses on leveling up, collecting gold, acquiring items and fighting against the other team to achieve victory. Each player \ncommands one of 110 controllable character \"Heroes\". Each Hero begins the match at level one and becomes more powerful by accumulating experience \npoints through combat, thereby leveling up to the maximum level of twenty-five. \nWith every level gained the player either selects a new ability for their Hero to learn or enhance their general statistics. Each Hero's method of combat is influenced by its primary property: Strength, Ag\n\nRules:\n\nGamemode : -cm mode(Captains mode)\nA coin toss decides which team has 'Selection Priority'. The team with Selection Priority gets to either pick their side of the map or the drafting order.","event_max_team_number":"5","cat_name":"Gaming","cat_id":"16","venue":"NLH 402,403,404,405","start_time":"14:00","end_time":"20:00","day":"1","date":"7-Oct","contact_name":"Vishal Ranjan","contact_number":"7259631381"},{"id":"152","event_name":"Defense Of  The Ancients II","event_id":"76","description":"Dota 2 is a multiplayer online battle arena video game, the stand-alone sequel to the Defense of the Ancients (DotA), developed by Valve Corporation. Dota 2 is played in matches involving two teams of five players, each of which occupies a \nstronghold at a corner of the map. Each stronghold contains a building called the \"Ancient\", which the opposite team must destroy to win the match. Each player \ncontrols a \"Hero\" character and focuses on leveling up, collecting gold, acquiring items and fighting against the other team to achieve victory. Each player \ncommands one of 110 controllable character \"Heroes\". Each Hero begins the match at level one and becomes more powerful by accumulating experience \npoints through combat, thereby leveling up to the maximum level of twenty-five. \nWith every level gained the player either selects a new ability for their Hero to learn or enhance their general statistics. Each Hero's method of combat is influenced by its primary property: Strength, Ag\n\nRules:\n\nGamemode : -cm mode(Captains mode)\nA coin toss decides which team has 'Selection Priority'. The team with Selection Priority gets to either pick their side of the map or the drafting order.","event_max_team_number":"5","cat_name":"Gaming","cat_id":"16","venue":"NLH 402,403,404,405","start_time":"14:00","end_time":"20:00","day":"2","date":"8-Oct","contact_name":"Vishal Ranjan","contact_number":"7259631381"},{"id":"153","event_name":"Defense Of  The Ancients II","event_id":"76","description":"Dota 2 is a multiplayer online battle arena video game, the stand-alone sequel to the Defense of the Ancients (DotA), developed by Valve Corporation. Dota 2 is played in matches involving two teams of five players, each of which occupies a \nstronghold at a corner of the map. Each stronghold contains a building called the \"Ancient\", which the opposite team must destroy to win the match. Each player \ncontrols a \"Hero\" character and focuses on leveling up, collecting gold, acquiring items and fighting against the other team to achieve victory. Each player \ncommands one of 110 controllable character \"Heroes\". Each Hero begins the match at level one and becomes more powerful by accumulating experience \npoints through combat, thereby leveling up to the maximum level of twenty-five. \nWith every level gained the player either selects a new ability for their Hero to learn or enhance their general statistics. Each Hero's method of combat is influenced by its primary property: Strength, Ag\n\nRules:\n\nGamemode : -cm mode(Captains mode)\nA coin toss decides which team has 'Selection Priority'. The team with Selection Priority gets to either pick their side of the map or the drafting order.","event_max_team_number":"5","cat_name":"Gaming","cat_id":"16","venue":"NLH 402,403,404,405","start_time":"14:00","end_time":"20:00","day":"3","date":"9-Oct","contact_name":"Vishal Ranjan","contact_number":"7259631381"},{"id":"154","event_name":"Defense Of  The Ancients II","event_id":"76","description":"Dota 2 is a multiplayer online battle arena video game, the stand-alone sequel to the Defense of the Ancients (DotA), developed by Valve Corporation. Dota 2 is played in matches involving two teams of five players, each of which occupies a \nstronghold at a corner of the map. Each stronghold contains a building called the \"Ancient\", which the opposite team must destroy to win the match. Each player \ncontrols a \"Hero\" character and focuses on leveling up, collecting gold, acquiring items and fighting against the other team to achieve victory. Each player \ncommands one of 110 controllable character \"Heroes\". Each Hero begins the match at level one and becomes more powerful by accumulating experience \npoints through combat, thereby leveling up to the maximum level of twenty-five. \nWith every level gained the player either selects a new ability for their Hero to learn or enhance their general statistics. Each Hero's method of combat is influenced by its primary property: Strength, Ag\n\nRules:\n\nGamemode : -cm mode(Captains mode)\nA coin toss decides which team has 'Selection Priority'. The team with Selection Priority gets to either pick their side of the map or the drafting order.","event_max_team_number":"5","cat_name":"Gaming","cat_id":"16","venue":"NLH 402,403,404,405","start_time":"14:00","end_time":"20:00","day":"4","date":"10-Oct","contact_name":"Vishal Ranjan","contact_number":"7259631381"}]}